{"id":"5417","code":"973SMCPTBMS10","pagename":"CurriculumGeneralManagementM1.LVMasterSeminarAdvancedTopicsInB2B-MarketingSE","type":"3","ects":"2","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","lv_id":"5417","wst":"1","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"2","langname":"English","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme General Management 2013W","fachbereichname":"Business Administration","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 2. year","levelshort":"M2","title":"Master Seminar Advanced Topics in B2B-Marketing","headtitle":"Master Seminar Advanced Topics in B2B-Marketing","ziele":"Students are supposed to acquire the ability to deal with the specific conditions of marketing decisions in business-to-business (B2B) markets. Based on a critical reflection of the state of the art literature, that is supported by short lectures, and by developing applied research papers, students possess the necessary analytical capabilities to successfully solve practical marketing problems of B2B companies.\n","lehrinhalte":"The course consists of two major parts. In part I, short lectures that are accompanied by class discussions provide the basis for understanding a value-based approach to B2B marketing. The following topics are covered:\n<\/p>\n<p class='vspace'>- Scope, relevance, and characteristics of B2B marketing<br \/>- Organizational buying behavior<br \/>- Typologies of B2B transactions<br \/>- The value concept as cornerstone of B2B marketing<br \/>- Management of customer benefit<br \/>- Price management\n<\/p>\n<p class='vspace'>In Part II, students are expected to present applied research papers dealing with selected aspects of practical marketing problems in B2B markets.\n","beurteilung":"- Final exam in class (40%): 60 percent of total points necessary to reach a passing exam grade<br \/>- Quality of the applied research paper (40%)<br \/>- Paper presentation (20%)\n<\/p>\n<p class='vspace'>For an overall passing grade, in each of the three assessment categories a passing grade has to be reached.\n","sonstiges":"Attendance and active participation are required for all students in order to ensure a thorough understanding of the value-based approach to B2B marketing. Students are expected to stay for the duration of the whole class, and to attend all classes. If for any special reason a student is not able to meet these requirements, s\/he has to talk to the lecturer in advance.\n","voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Positive Absolvierung der Module \n<\/p><ul><li>Strategic Management\n<\/li><li>Marketing\n<\/li><li>Organization\n<\/li><li>Human Resource &amp; Change Management\n<\/li><li>Managerial Accounting\n<\/li><\/ul>","methoden":"Prep reading, short lectures, class discussions, development and presentation of applied research papers\n","literatur":"Reading package; can be purchased at the department secretary’s office (Managementzentrum, 2nd floor, room 205A) one week before the first session.\n","equivalent":null,"children":[]}