{"id":"2828","code":"526ESWE11","pagename":"CurriculumWirtschaftsinformatikB02008W.FachEinführungInDieSoftwareentwicklung","type":"1","ects":"6","verantname":"Alois Ferscha","verantemail":"alois.ferscha@jku.at","changedate":"2012-02-14 00:00:00","version":"2012S","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2009W","pruefungname":"Kumulative Fachprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2009W","fachbereichname":"Informatik","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1","title":"Einführung in die Softwareentwicklung","headtitle":"Einführung in die Softwareentwicklung","ziele":"Die Studierenden sind mit (syntax-unabhängigen) modernen Methoden der Programmierung vertraut, verfügen über elementare Kenntnisse in der Entwicklung von algorithmischen Programmen und der Fähigkeit der objektorientierten Programmierung, beherrschen Kontrollstrukturen und sind mit elementaren Konzepten der Datenrepräsentation, insbesondere mit Listen, Bäumen, rekursiven Datenstrukturen und Algorithmen dafür vertraut. Sie beherrschen die Programmiersprache Java.\n","lehrinhalte":"Begriffsfestlegungen:<br \/>Problemlösungsstrategien<br \/>Maschinen, Daten und Befehle<br \/>Algorithmusbegriff<br \/>Formale Sprachen, Ausdrücke, Grammatiken<br \/>Programmiersprachen und Übersetzer<br \/>Syntaxkonstrukte:<br \/>Primitive Datentypen und Literale<br \/>Variablen, Namen, Deklaration, Initialisierung<br \/>Operatoren (arithmetische, Vergleichs-, Zuweisungs-, logische, bitweise, unäre) <br \/>Operatorprioritäten, Typumwandlung<br \/>Anweisungen, Sichtbarkeit und Anweisungsfolgen<br \/>Arrays und Zeichenketten<br \/>Kontrollstrukturen<br \/>Grundkonzepte zur Programmierung: <br \/>Objekte, Klassen, Attribute, Methoden<br \/>Referenzen auf Objekte, Konstruktoren<br \/>Programmierung mit Objekten<br \/>Prozeduren und Parameter<br \/>Ein- Ausgabe, Files<br \/>Interfaces<br \/>Erweiterungen von Klassen (Überladung, Vererbung)<br \/>Ausgewählte Spezielle Programmierkonzepte:<br \/>Dynamische Datenstrukturen (Beispiel Listen)<br \/>Überblick Dynamische Datenstrukturen (Graphen, Queues, Stapel, Mengen)<br \/>Selbstbezug und Beschreibungsmittel<br \/>Rekursive Algorithmen (lineare und nichtlineare, Beispiel Mergesort)<br \/>Rekursive Datenstrukturen (Beispiel Bäume)<br \/>Ereignisse und Ereignisbehandlung<br \/>Ausnahmen<br \/>Threads<br \/>Organisation der Programmierung:<br \/>Programmierkonventionen (Code Conventions)<br \/>Dateiorganisation, Gliederung, Kommentare<br \/>Strukturierungskonzepte für umfangreiche Programme<br \/>Dokumentation<br \/>Pakete<br \/>Tools und Entwicklungsumgebungen\n","beurteilung":"Die in den einzelnen Lehrveranstaltungen verwendeten Prüfungsformen variieren und sind der jeweiligen Lehrveranstaltungsbeschreibung zu entnehmen. Die Gesamtnote des Moduls wird gemäß § 16 Abs 6 Satzungsteil Studienrecht ermittelt.\n","sonstiges":null,"voraussetzungen":"keine\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41258},{"id":41259}]}