{"id":"5554","code":"973GMCPHRC10","pagename":"CurriculumGeneralManagementM1.ModulHumanResourceChangeManagement","type":"2","ects":"6","verantname":"Wolfgang Güttel","verantemail":"wolfgang.guettel@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","pruefungname":"Eine Lehrveranstaltungsprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Human Resource &amp; Change Management","headtitle":"Human Resource &amp; Change Management","ziele":"<ul><li>Ausgehend von den Grundlagen zu Management sowie zu Human Resource and Change Management erfolgt eine vertiefte wissenschaftliche Auseinandersetzung mit Lern- und Veränderungsprozessen auf individueller, Gruppen- und organisationaler Ebene.\n<\/li><li>Vertiefte Fähigkeit, die wissenschaftliche Diskussion im Bereich Strategic Change und Learning zu interpretieren und eigenständige wissenschaftliche Beiträge zu schreiben und zu präsentieren.\n<\/li><li>Diskussion wissenschaftlicher Erkenntnisse über Genderaspekte im Human Resource and Change Management.\n<\/li><li>Vertiefte Fähigkeit, die Relevanz aktueller Forschungsbeiträge aus dem Bereich Strategic Change und Learning für die Management-Praxis zu beurteilen und Konsequenzen für die Praxis zu formulieren.\n<\/li><\/ul>","lehrinhalte":"Strategic Change and Learning<br \/>strategic management and planning as starting points of formulating an HRM-strategy; foundations of behaviour in organizations (motivation, skills, culture, and structure as central levers of individual behaviour in organizations); groups as institutions that determine social norms and impact on organizational culture, strategic and operational aspects of HRM issues (motivation, commitment, equal (gender)opportunities, pay and rewards, HR-development, performance evaluation, leadership); strategic learning on various levels (individual, group, organization); routines and capabilities as drivers of organizational patterns of action, interventions in social systems (groups and organizations); balancing the antagonistic tendencies of stability and change; organizational development\n","beurteilung":null,"sonstiges":null,"voraussetzungen":"keine\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41105}]}