{"id":"7248","code":"2WATPBISE","pagename":"CurriculumWirtschaftsinformatikM02008W.LVAdvancedTextProductionInBusinessInformaticsSE","type":"3","ects":"3","verantname":"Evelyne Glaser","verantemail":"evelyne.glaser@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7248","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"2","langname":"Englisch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Sprachen","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Advanced Text Production in Business Informatics","headtitle":"Advanced Text Production in Business Informatics","ziele":"Die Studierenden besitzen vertiefte Sprachkompetenz (in Wort und Schrift) in der Fachsprache Englisch, insbesondere im Hinblick auf Themenstellungen der Wirtschaftsinformatik.\n","lehrinhalte":"Planen, Strukturieren und Verfassen von wissenschaftlichen Texten (insbesondere auch der Masterarbeit) und Präsentationen aus dem Gebiet der Wirtschaftsinformatik in englischer Fachsprache, kritische Auseinandersetzung mit Fachtexten, Entwicklung und Übung von Argumentationen; Verfassen von Abstracts, Proposals, persönlichen Profilen (Biodata) für Publikationen und Kongresse.\n","beurteilung":"Schriftliche Ausarbeitungen während der Präsenzzeit im Seminar (25 %), Präsentation des Fachthemas (25 %), schriftliche Arbeit zum Fachthema (50 %).\n","sonstiges":"Das Seminar Advanced Text Production in Business Informatics ist in Kombination mit einem Seminar aus dem Fach „Ausgewählte Aspekte der Wirtschaftsinformatik“ oder mit dem Masterarbeitsseminar zu absolvieren, wobei die im Fachsprachenkurs vermittelten Techniken anhand der Themenstellung des Wirtschaftsinformatik-Seminars praktisch geübt werden. Dazu sind eine gemeinsame, d.h. fachliche und fachsprachliche Abschlussarbeit bzw. Masterarbeit und deren Präsentation vorgesehen. Die Beurteilung erfolgt getrennt und obliegt der jeweiligen Lehrveranstaltungsleitung.\n","voraussetzungen":null,"methoden":"Vortrag, Diskussionen, Übungen zu verschiedenen Techniken des Schreibens, online Materialien\n","literatur":"Web-basierte Unterlagen; von der LVA-Leitung bereit gestellte Seminarunterlagen\n<\/p>\n<div class='vspace'><\/div><ul><li>Davis, M. (1997). Scientific Papers and Presentations, San Diego: Academic Press.\n<\/li><li>Gustavii, B. (2008). How to Write and Illustrate a Scientific Paper. Cambridge: Cambridge University Press.\n<\/li><li>Malmfors, B., Garnsworthy, P., &amp; Grossman, M. (2004). Writing and Presenting Scientific Papers. Nottingham: Nottingham University Press.\n<\/li><\/ul><p class='vspace'>Ergänzungsliteratur wird in jedem Semester bekannt gegeben.\n","equivalent":null,"children":[]}