{"id":"7341","code":"2WSEP","pagename":"CurriculumWirtschaftsinformatikB02008W.LVSoftwareEngineeringPR","type":"3","ects":"6","verantname":"Alois Stritzinger","verantemail":"alois.stritzinger@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7341","wst":"4","teilungsziffer":"15","zuteilung":"1","lvtyp":"6","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Praktikum","lvtypshort":"PR","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 2. Jahr","levelshort":"B2","title":"Software Engineering","headtitle":"Software Engineering","ziele":"Die Studierenden sind befähigt, in Softwareprojekten in allen vorkommenden Rollen verantwortlich mitzuwirken. Sie sind in der Lage, ihren Wissensstand im Software Engineering (Methoden, Konzepte, Lösungsansätze, etc.) anhand von Erfahrungen aus einem praxisnahen Einsatzkontext einzuschätzen, Erkenntnisse der Sozial- und Wirtschaftswissenschaften, Ingenieurwissenschaften und Rechtswissenschaften zu integrieren und einzusetzen, in Gruppen teamorientiert zu arbeiten, Verhandlungen zu führen und Ziele durchzusetzen.\n","lehrinhalte":"Umsetzung und praktische Erprobung des im Modul Methoden und Konzepte erworbenen Wissens in einem Softwareprojekt mit angemessener Komplexität unter Anwendung insbesondere von Führungs-, Verhandlungs-, Konfliktlösungstechniken, Teamorganisation, Kommunikations- und Moderationstechniken.\n","beurteilung":"Die Lehrveranstaltung hat immanenten Prüfungscharakter. Beurteilungsgrundlage sind die Intensität und Professionalität der Mitarbeit im Team, sowie die erzielten Ergebnisse (Entwicklungsergebnis und Projektreport).\n","sonstiges":"Zur Vorbereitung der Projektabwicklung werden zu Beginn der Lehrveranstaltung Trainingseinheiten mit Vertiefungs- und Ergänzungscharakter für Fach-, personale und soziale Kompetenz angeboten.\n","voraussetzungen":null,"methoden":null,"literatur":"Die Aufgabenstellungen der angebotenen Praktika variieren von Semester zu Semester. Die projektrelevante Literatur muss von den Studierenden selbst besorgt werden, sie werden dabei vom Institut durch die zur Verfügungstellung von Einstiegsliteratur unterstützt.<br \/>\n<\/p>\n<p class='vspace'>Einstiegsliteratur: \n<\/p><ul><li>Kuster, J.; Huber, E.; Lippmann, R.; Schmid, A.; Schneider, E.; Witschi, U.; Wüst, R.: Handbuch Projektmanagement. Springer Verlag, 2007. \n<\/li><li>Oestereich, B.; Weiss, C.: APM - Agiles Projektmanagement: Erfolgreiches Timeboxing für IT-Projekte. dpunkt.Verlag, 2007.\n<\/li><li>Hindel, B.; Hörmann, K.; Müller, M.; Schmied, J.: Basiswissen Software-Projektmanagement: Aus- und Weiterbildung zum Certified Professional for Project Management nach iS-QI-Standard. dpunkt.Verlag, 2009. \n<\/li><li>Patzak, G.; Rattay, G.: Projektmanagement: Leitfaden zum Management von Projekten, Projektportfolios und projektorientierten Unternehmen. Linde Verlag, 2008.\n<\/li><\/ul>","equivalent":null,"children":[]}