{"id":"1735","code":"971ATECRATK10","pagename":"CurriculumEconomicsM1.LVRegulationAndAntitrust","type":"3","ects":"4","verantname":"Christine Zulehner","verantemail":"christine.zulehner@jku.at","changedate":"2012-07-04 00:00:00","version":"2011S","currname":"Economics","currnameeng":"Economics","currversion":"2010W","lv_id":"1735","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"1","sprache":"2","langname":"Englisch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium Economics 2010W","fachbereichname":"Volkswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Regulation and Antitrust","headtitle":"Regulation and Antitrust","ziele":"Das Ziel des Kurses ist es, das Wissen Studierender im Bereich der Industrieökonomie und Wettbewerbsökonomie auf dem Master-Niveau zu vertiefen. Ein besonderes Augenmerk wird auf empirische Anwendungen sowie die Diskussion von Papieren gelegt. Dieser Kurs enthält Einheiten zu spieltheoretischen Modellen und deren Anwendung. Die Einheiten werden durch Fallstudien unterstützt, um die Anwendung theoretischer und ökonometrischer Modelle anhand realer Situationen zu erlernen.\n","lehrinhalte":"Dieser Kurs ist ein Kurs zu Wettbewerb und Regulierung für Studierende im Masterstudium. Der erste Teil des Kurses widmet sich der Regulierung von Wettbewerb. Es werden die wesentlichen Faktoren, die einen Markt beschreiben, diskutiert, i.e. Nachfrage der Konsumenten\/innen, technologische Determinanten der Marktstruktur sowie spieltheoretische Modelle, die das Verhalten von Unternehmen in Monopol- und Oligopolmärkten erklären sollen. Zudem werden die Methoden, die bei Kartellfällen angewandt werden, erklärt, i.e. Marktdefinition, Schätzung von Nachfragefunktionen, Berechnung eines Kartellschadens und Entdeckung von Kartellen usw. Der zweite Teil des Kurses behandelt die Regulierung von Industrien. Es werden Preisprinzipien und Preisregulationen anhand des Telekommunikations- und Energiesektors besprochen. Ein weiteres Beispiel ist die Regulierung des Bankensektors.\n","beurteilung":"aktive Mitarbeit im Kurs, Fallstudien, Klausur\n<\/p>\n<div class='vspace'><\/div>","sonstiges":"-\n","voraussetzungen":"keine (die Zulassung zum Studium vorausgesetzt)\n","methoden":"Vortrag, Übungsbeispiele\n","literatur":"Massimo Motta (2004): Competition Policy, Theory and Practice, Cambridge University Press. \n<\/p>\n<p class='vspace'>Peter Davis and Eliana Garces (2010): Quantitative Techniques for Competition and Antitrust Analysis, Princeton University Press.\n<\/p>\n<p class='vspace'>Roger Sherman (2008): Market regulation, Pearson.\n<\/p>\n<p class='vspace'>Additional material:\nSimon Bishop and Mike Walker (2010): The Economics of C Competition Law: Concepts, Application and Measurement, Third Edition, Thomson Reuters. \n<\/p>\n<p class='vspace'>Jean Tirole (1988): Theory of Industrial Organization, MIT Press.\n<\/p>\n<p class='vspace'>Paul Belleflamme and Martin Peitz (2010): Industrial Organization: Markets and Strategies, Cambridge University Press.\n","equivalent":null,"children":[]}