{"id":"7274","code":"926MASP13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachMasterarbeitInklMasterarbeitsseminarUndMasterpruefung","type":"1","ects":"30","verantname":"Michael Schrefl","verantemail":"michael.schrefl@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Accumulative subject examination","currtypename":"Master's programme","curriculumname":"Master's programme Business Informatics 2013W","fachbereichname":"Business Informatics","typename":"Subject","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 2. year","levelshort":"M2","title":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Masterarbeit (inkl. Masterarbeitsseminar und Masterprüfung)","headtitle":"Masterarbeit (inkl. Masterarbeitsseminar und Masterprüfung)","ziele":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Studierenden sind im Kontext des Faches, aus dem das Thema der Masterarbeit gewählt wurde, auf die selbständige Bearbeitung der Masterarbeit vorbereitet und können den fachspezifischen und wissenschaftlichen Stellenwert ihrer Masterarbeit im Bereich der Wirtschaftsinformatik definieren. Im Masterarbeitsseminar werden die Studierenden bei der Bearbeitung des Themas ihrer Masterarbeit wissenschaftlich begleitet, insbesondere hinsichtlich der Strukturierung der Arbeit und des methodischen Vorgehens.\n","lehrinhalte":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Aufbau und Struktur wissenschaftlicher Arbeiten, Methoden und Techniken der systematischen Bearbeitung einer Problemstellung der Wirtschaftsinformatik im Kontext einer Masterarbeit, Präsentation und wissenschaftliche Reflexion von Arbeitsergebnissen\n","beurteilung":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Übernahme der Note des Moduls\n","sonstiges":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Masterarbeit behandelt ein Thema eines Kernfachs (Information Engineering, Software Engineering, Data &amp; Knowledge Engineering, Communications Engineering) oder eines Spezialisierungsfachs (Information Engineering &amp; Management, Service Engineering, Business Intelligence, Business Engineering &amp; Management) der Wirtschaftsinformatik, welches im Ausmaß von mindestens 12 ECTS absolviert wurde. Wird ein Studienabschluss mit einem Studienschwerpunkt angestrebt, muss die Masterarbeit auch einen Bezug zum Studienschwerpunkt aufweisen.\n<\/p>\n<p class='vspace'>Mit der Bearbeitung der Masterarbeit kann begonnen werden, wenn jene Studienfächer des Studiums absolviert sind, die thematisch für die Masterarbeit relevant sind. Was relevant ist, entscheidet die Betreuerin bzw. der Betreuer.\n<\/p>\n<p class='vspace'>Die Masterarbeit ist als schriftliche Hausarbeit anzufertigen. Das Thema ist so zu wählen, dass der Arbeitsumfang der Masterarbeit 26 ECTS umfasst. Die gemeinsame Bearbeitung eines Themas durch mehrere Studierende ist zulässig, wenn es möglich ist, die erbrachte Leistung einzeln zu beurteilen. \n<\/p>\n<p class='vspace'>Die Masterabschlussprüfung (im Ausmaß von 1 ECTS) ist eine mündliche Gesamtprüfung über das Themengebiet der Masterarbeit und jener beiden Spezialkompetenzen der Wirtschaftsinformatik, der Wirtschaftswissenschaften, oder der Informatik, die den größten Bezug zur Masterarbeit aufweisen. Die beiden Prüfungsfächer müssen jeweils im Mindestausmaß von 12 ECTS absolviert worden sein. Wird ein Studienabschluss mit einem Studienschwerpunkt angestrebt, müssen beide Prüfungsfächer zum Studienschwerpunkt gehören.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41192}]}