{"id":"7312","code":"526GRIN13","pagename":"CurriculumWirtschaftsinformatikB02008W.FachGrundlagenDerInformatik","type":"1","ects":"18","verantname":"Michael Schrefl","verantemail":"michael.schrefl@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Informatik","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1","title":"Grundlagen der Informatik","headtitle":"Grundlagen der Informatik","ziele":"Die Studierenden kennen die grundlegenden Begriffe und Konzepte der Informatik. Sie verstehen die Struktur und Funktionsweise von informationsverarbeitenden Systemen (Hard- und Software) und die Struktur und Arbeitsweise von Betriebssystemen. Sie besitzen Grundkenntnisse auf dem Gebiet der Softwareentwicklung einschließlich objektorientierter und ereignisgesteuerter Programmierung und beherrschen darin den Stand der Technik. Sie können einfache praktische Aufgaben im Bereich der Entwicklung von Softwaresystemen lösen.\n","lehrinhalte":"Das Fach vermittelt Grundlagenwissen zu ausgewählten Teilbereichen der Informatik. Details der Lehrinhalte können den untergeordneten Fächern entnommen werden.\n","beurteilung":"Die in den einzelnen Modulen verwendeten Prüfungsformen variieren und sind der jeweiligen Modulbeschreibung zu entnehmen. Die Gesamtnote des Faches Grundlagen der Informatik wird gemäß § 16 Abs (1) Z 2 Satzungsteil Studienrecht (gewichtete Beurteilung der Modulprüfungen) ermittelt.\n","sonstiges":"Die in den einzelnen Modulen verwendeten Prüfungsformen variieren und sind der jeweiligen Modulbeschreibung zu entnehmen. \n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41254},{"id":41257},{"id":41260}]}