{"id":"6302","code":"921NESENMAK13","pagename":"CurriculumInformatikM02007W.LVNetworkManagementKV","type":"3","ects":"3","verantname":"Rudolf Hörmanseder","verantemail":"Rudolf.Hoermanseder@jku.at","changedate":"2013-07-02 00:00:00","version":"2013W","currname":"Computer Science","currnameeng":"Computer Science","currversion":"2013W","lv_id":"6302","wst":"2","teilungsziffer":"0","zuteilung":"3","lvtyp":"10","wechselnd":"0","sprache":"4","langname":"English","lvtypname":"Kombinierte LV","lvtypshort":"KV","zuteilungname":"Direktzuteilung","currtypename":"Masterstudium","curriculumname":"Masterstudium Computer Science 2013W","fachbereichname":"Informatik","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Network Management","headtitle":"Network Management","ziele":"Die Studierenden kennen von einzelnen für den Betrieb von Netzwerken erforderlichen Protokollen den Einsatzbereich sowie die algorithmischen Grundlagen und verstehen wesentliche Zusammenhänge \/ das „Zusammenspiel“ dieser Protokolle.\nMit den im Labor gemachten praktischen Erfahrungen bei Konfiguration und Einsatz von Netzwerk-Devices bildet dies eine gute Basis, um sich effizient in spezielle Aufgabenstellungen im Netzwerkbereich einarbeiten zu können.\n","lehrinhalte":"Beispielhaft werden behandelt: Aufgabe und Einsatz von Netzwerk-Management-Systemen, VLANs, (Multiple) Spanning Tree Protocol, Link Aggregation, 802.1X, Radius, SNMP (Simple Network Management Protocol), VRRP (Virtual Router Redundancy Protocol), Routingprotokolle (z.B. RIP, OSPF), QoS (Quality of Service), Load Balancing, Trill (Transparent Interconnection of Lots of Links).\nDiese Inhalte werden in einem Überblick präsentiert. Auf einzelne Konzepte wird vertiefend eingegangen und diese werden auch in den Laborübungen verwendet.\n","beurteilung":"Beurteilt werden die Mitarbeit in den Laborübungen, die schriftlichen Zusammenfassungen der Laborübungen sowie die schriftliche Abschlussklausur. Für einen positiven Abschluss der Lehrveranstaltung ist eine positive Bewertung jedes der drei Teile erforderlich.\n","sonstiges":"<a class='urllink' href='http:\/\/www.fim.jku.at\/LVA\/Network-Management\/' title='' rel='nofollow'>http:\/\/www.fim.jku.at\/LVA\/Network-Management\/<\/a>\n","voraussetzungen":"Verpflichtend: VO UE Netzwerke und verteilte Systeme (aus Bachelor Informatik)\n","methoden":"Vorlesungsteile inkl. Diskussionen werden durch Übungen\/Szenarien im Netzwerklabor ergänzt und vertieft.\n","literatur":"Vortragsfolien und Vortragstexte\n<\/p>\n<p class='vspace'>Exemplarische Beispiele für Basisliteratur:\n - Clemm, A.: Network Management Fundamentals. Cisco Press  \n - Doyle, J.; Carroll, J.: Routing TCP\/IP. Cisco Press\n - Mauro, D.; Schmidt, K. J.: Essential SNMP. O'Reilly\n<\/p>\n<p class='vspace'>White-Papers und Handbücher der Hersteller zu den im Labor verwendeten Komponenten (derzeit insbesondere Cisco, HP und Juniper).\n<\/p>\n<p class='vspace'>Ergänzungsliteratur wird in jedem Semester bekanntgegeben.\n","equivalent":"<strong>in collaboration with 921NESENSEK13: KV Network Security (1,5 ECTS) equivalent to<\/strong><br \/>INMNPKVNMAN: KV Netzwerk-Management (4,5 ECTS)\n","children":[]}