{"id":"7275","code":"2WMASSE","pagename":"CurriculumWirtschaftsinformatikM02008W.LVMasterarbeitsseminarSE","type":"3","ects":"3","verantname":"Michael Schrefl","verantemail":"michael.schrefl@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7275","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"1","langname":"German","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme Business Informatics 2013W","fachbereichname":"Business Informatics","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 2. year","levelshort":"M2","title":"Seminar for Graduate Students","headtitle":"Seminar for Graduate Students","ziele":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Studierenden sind im Kontext des Faches, aus dem das Thema der Masterarbeit gewählt wurde, auf die selbständige Bearbeitung der Masterarbeit vorbereitet und können den fachspezifischen und wissenschaftlichen Stellenwert ihrer Masterarbeit im Bereich der Wirtschaftsinformatik definieren. Im Masterarbeitsseminar werden die Studierenden bei der Bearbeitung des Themas ihrer Masterarbeit wissenschaftlich begleitet, insbesondere hinsichtlich der Strukturierung der Arbeit und des methodischen Vorgehens.\n","lehrinhalte":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Aufbau und Struktur wissenschaftlicher Arbeiten, Methoden und Techniken der systematischen Bearbeitung einer Problemstellung der Wirtschaftsinformatik im Kontext einer Masterarbeit, Präsentation und wissenschaftliche Reflexion von Arbeitsergebnissen.\n","beurteilung":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Beurteilung erfolgt aufgrund der Präsentationen der Zwischen- und Endergebnisse der Masterarbeit sowie aufgrund der Beteiligung an der wissenschaftlichen Reflexion zu den Masterarbeiten der anderen SeminarteilnehmerInnen.\n","sonstiges":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Studierenden erhalten wissenschaftliche Begleitung bei der Bearbeitung ihrer Masterarbeit, insbesondere bei der Erstellung der inhaltlichen Gliederung sowie der Konzeption des methodischen Vorgehens. Die Studierenden präsentieren Zwischen- und Endergebnisse der Masterarbeit.\n","voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Aufnahme in das Masterarbeitsseminar erfolgt in Absprache mit dem\/der Betreuer\/in der Masterarbeit.\n","methoden":null,"literatur":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Den Studierenden wird die Möglichkeit geboten, die für die Masterarbeit relevante Literatur von Digitalen Bibliotheken wie z.B. ACM, IEEE und SpringerLink zu beziehen. Darüber hinaus stehen die Fachbereichsbibliothek „Betriebswirtschaftslehre, Wirtschaftsinformatik und Fachsprachen“ sowie die Präsenzbibliothek des jeweiligen Instituts zur Verfügung.\n","equivalent":null,"children":[]}