{"id":"5413","code":"973SMCPMI110","pagename":"CurriculumGeneralManagementM1.ModulMarketingInternationalMarketing1","type":"2","ects":"6","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","pruefungname":"Kumulative Modulprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Master 2. Jahr","levelshort":"M2","title":"Marketing &amp; International Marketing 1","headtitle":"Marketing &amp; International Marketing 1","ziele":"<ul><li>Die Studierenden setzen sich, unterstützt durch didaktische Methoden wie Gruppenarbeiten, Diskussionen und Präsentationen, intensiv mit ausgewählten Problembereichen des internationalen Marketing auseinander.\n<\/li><li>Sie kennen und verstehen die einschlägige State of the Art-Literatur und sind auf dieser Basis in der Lage, sich Spezialwissen in aktuellen Problemfeldern des internationalen Marketing anzueignen.\n<\/li><li>Die Studierenden lernen in Projekten auf Basis von Fallstudien oder für Kooperationspartner die selbständige Auseinandersetzung mit ausgewählten und aktuellen Problemstellungen des internationalen Marketing.\n<\/li><li>Sie kennen und verstehen die Rahmenbedingungen, unter denen Marketingentscheidungen in der Unternehmenspraxis getroffen werden und sind in der Lage, methodisch und konzeptionell fundierte Lösungsansätze zu entwickeln.\n<\/li><\/ul>","lehrinhalte":"Das Modul umfasst Grundlagen des internationalen Marketing, Emerging Markets, Herausforderungen der internationalen Marketingumwelt, Informationsgewinnung für internationale Marketingentscheidungen, Selektion von Ländermärkten, Markteintritts- und Bearbeitungsstrategien für Auslandsmärkte, Spezialfragen wie Standardisierung vs. Adaptierung, Entscheidungen im Rahmen der Produktpolitik, Preispolitik, Distributionspolitik, Kommunikationspolitik und Markenpolitik im internationalen Kontext. Bearbeitung spezifischer Problemstellungen anhand von Diskussionen, Gruppenarbeiten, Präsentationen, Fallstudien oder Praxisprojekten.\n","beurteilung":null,"sonstiges":null,"voraussetzungen":"Positive Absolvierung der Module\n<\/p><ul><li>Strategic Management \n<\/li><li>Marketing \n<\/li><li>Organization \n<\/li><li>Human Resource &amp; Change Management \n<\/li><li>Managerial Accounting\n<\/li><\/ul>","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41119},{"id":41120}]}