{"id":"5551","code":"973GMCPMARK10","pagename":"CurriculumGeneralManagementM1.LVMasterCourseDimensionsOfMarketingTheoryAndManagerialApplicationKS","type":"3","ects":"6","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","lv_id":"5551","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"2","langname":"Englisch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Master Course Dimensions of Marketing Theory and Managerial Application","headtitle":"Master Course Dimensions of Marketing Theory and Managerial Application","ziele":"The postgraduate course \"Dimensions of Marketing Theory and Managerial Application\" builds on base-knowledge marketing courses from the Bachelor's degree program. The course provides students with an in-depth overview of state-of-the-art trends under the philosophy of science and encourages methodological discussions in marketing science. The expansive specialized course materials focus on original resources enabling students to integrate different theoretical marketing approaches as well as understand their commonalities and characteristics.\n","lehrinhalte":"The postgraduate course \"Dimensions of Marketing Theory and Managerial Application\" addresses the theoretical fundamentals of marketing and their applications in practice, augmented with current trends dealing with the perspectives of advancement from different theoretical approaches. The course examines different approaches found in German-speaking and English-speaking marketing sciences in detail. Various controversial positions are argued with respect to detailed marketing phenomena as well as propositions considering foundation and application of marketing knowledge which have been stated by the exponents of the different approaches over time.\n","beurteilung":"The instructor will calculate your grade as follows: \n<\/p><ul><li>Continual update of concept maps, contribution to in-class discussion and completion of  Marketing Journey Itinerary (MJI) until end of the semester, due date will be given – satisfactory analysis reflection,  90 points\n<\/li><li>Final examination – 60 points\n<\/li><\/ul><p>Students must earn more than 50 % of the total overall points available in order to pass the course.\n","sonstiges":null,"voraussetzungen":"keine (die Zulassung zum Studium vorausgesetzt)\n","methoden":"Reading assignments of related articles and book chapters in marketing theory and application. Development and discussion of a map of critical (CMAPs) concepts in marketing. Writing essays based on article material dealing with developments in the scientific domain. Critical reflection of lead concepts and suggestions for improvement and revision. Marketing journey itinerary (MJI) will be the individual outcome for each student. \n","literatur":"Articles provided by instructor;  \n<\/p>\n<p class='vspace'>Maclaran, P. et al. (Eds.); The SAGE Handbook of Marketing Theory, Los Angeles-London-New Delhi-Singapore-Washington DC, 2010\nTadajewski\/Brownlie (Eds.); Critical Marketing. Issues in Contemporary Marketing, Chichester, West Sussex 2008\nHomburg\/Kuester\/Krohmer; Marketing Management. A Contemporary Perspective, London etc. 2009 \n<\/p>\n<p class='vspace'>Moon, B. M et al. (Eds.); Applied Concept Mapping. Capturing, Analyzing and Organizing Knowledge, Boca Raton - London - New York, 2011\n","equivalent":null,"children":[]}