{"id":"5890","code":"1BBUHAK","pagename":"CurriculumWirtschaftswissenschaftenB1.LVBuchhaltung","type":"3","ects":"2","verantname":"Carina Öppinger","verantemail":"carina.oeppinger@jku.at","changedate":"2014-05-07 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":"Business and Economics","currversion":"2013W","lv_id":"5890","wst":"1","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftswissenschaften 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1S","title":"Buchhaltung","headtitle":"Buchhaltung","ziele":"Ziel dieser Lehrveranstaltung ist, ein grundlegendes Verständnis für das Rechnungswesen, insbesondere die Systematik und Funktion der Buchhaltung, zu erhalten. \n","lehrinhalte":"Am Anfang der LVA steht eine allgemeine Einführung in die Welt des Rechnungswesens, wobei Aufgabe, Funktion, Adressaten und rechtliche Grundlagen der Buchhaltung diskutiert werden. In einem nächsten Schritt erfolgt die Abgrenzung und Erläuterung zentraler Begriffe wie z. B. \"Inventur\" und \"Inventar\" sowie die eingehende Betrachtung der Bilanz als zentrales Element der Buchhaltung.<br \/>\nWichtiger Bestandteil dieser LVA sind die Grundlagen der Buchungstechnik. Dabei wird das Konstrukt \"Konto\" als grundlegender Baustein der Bilanz erarbeitet und Buchungssätze sowie Eröffnungs- und Schlussbilanz vorgestellt. Anhand wichtiger Geschäftsfälle von Handels- und Industriebetrieben wird die konkrete Anwendung der Buchungstechnik gezeigt.\n","beurteilung":"Klausur\n","sonstiges":null,"voraussetzungen":"keine\n","methoden":"Klausur\n","literatur":"Geirhofer\/Hebrank (2010): Grundlagen Buchhaltung und Bilanzmanagement, 3. Auflage. Für den Kurs Buchhaltung sind folgende Kapitel des Buches relevant: Kapitel 1, Kapitel 2, Kapitel 3.7 sowie Kapitel 6. \n","equivalent":"Studierende, die ihre Reifeprüfung im Rahmen des Lehrplanes von kaufmännischen höheren Schulen oder von höheren Lehranstalten für wirtschaftliche Berufe, für Tourismus, für Mode und Bekleidungstechnik sowie für künstlerische Gestaltung innerhalb der letzten 6 Jahre ab Antragstellung abgelegt haben, erhalten den Kurs Buchhaltung jedenfalls anerkannt. Sonstige Prüfungen werden im Einzelfall nach Maßgabe der Gleichwertigkeit anerkannt.\n","children":[]}