{"id":"1735","code":"971ATECRATK10","pagename":"CurriculumEconomicsM1.LVRegulationAndAntitrust","type":"3","ects":"4","verantname":"Christine Zulehner","verantemail":"christine.zulehner@jku.at","changedate":"2012-07-04 00:00:00","version":"2011S","currname":"Economics","currnameeng":"Economics","currversion":"2010W","lv_id":"1735","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"1","sprache":"2","langname":"English","lvtypname":"Course","lvtypshort":"KS","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme Economics 2010W","fachbereichname":"Economics","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Regulation and Antitrust","headtitle":"Regulation and Antitrust","ziele":"The aim of this course is to expand students' knowledge of advances in the field of industrial organization and competition economics at the master level. A particular emphasis is put on empirical applications and the discussion of papers. This course provides lectures on the basic game theoretic models as well as on the empirical implentation of these models and their applications. The lectures are supplemented with case studies to learn how to apply the theoretical and the econometric models to real world situations. \n<\/p>\n<div class='vspace'><\/div>","lehrinhalte":"This course is a Masters course on antitrust and regulation. The first part of this course deals with the regulation of competition. We start by discussing the determinants of market outcomes, i.e. consumer demand, technological determinants of market structure and game theoretical models explaining market behavior in monopolies and oligopolies. We also cover methods applied in antitrust cases such as market definition, estimation of demand functions, calculation of cartel damages and detection of cartels. The second part of this course deals with the regulation of industries. We discuss pricing principles and price regulation on the basis of the telecommunication and the energy industry. A further example is the banking sector.\n","beurteilung":"class participation, problem sets, take home final \n","sonstiges":"-\n","voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>keine (die Zulassung zum Studium vorausgesetzt)\n","methoden":"Lecture, practice exercises\n","literatur":"Massimo Motta (2004): Competition Policy, Theory and Practice, Cambridge University Press. \n<\/p>\n<p class='vspace'>Peter Davis and Eliana Garces (2010): Quantitative Techniques for Competition and Antitrust Analysis, Princeton University Press.\n<\/p>\n<p class='vspace'>Roger Sherman (2008): Market regulation, Pearson.\n<\/p>\n<p class='vspace'>Additional material:\nSimon Bishop and Mike Walker (2010): The Economics of C Competition Law: Concepts, Application and Measurement, Third Edition, Thomson Reuters. \n<\/p>\n<p class='vspace'>Jean Tirole (1988): Theory of Industrial Organization, MIT Press.\n<\/p>\n<p class='vspace'>Paul Belleflamme and Martin Peitz (2010): Industrial Organization: Markets and Strategies, Cambridge University Press.\n","equivalent":null,"children":[]}