{"id":"7347","code":"2WDEP","pagename":"CurriculumWirtschaftsinformatikB02008W.LVDataKnowledgeEngineeringPR","type":"3","ects":"6","verantname":"Michael Karlinger","verantemail":"michael.karlinger@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7347","wst":"4","teilungsziffer":"15","zuteilung":"1","lvtyp":"6","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Praktikum","lvtypshort":"PR","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 3. Jahr","levelshort":"B3","title":"Data &amp; Knowledge Engineering","headtitle":"Data &amp; Knowledge Engineering","ziele":"Die Studierenden können im Team praxisrelevante Aufgabenstellungen des Data- und Knowledge Engineering lösen. Sie sind in der Lage, ein ausgewähltes Werkzeug zur Problemlösung einzusetzen, wie zum Beispiel ein objektorientiertes bzw. objektrelationales Datenbankverwaltungssystem. Sie sind in der Lage, theorie- und konzeptgeleitet Aufgaben selbständig und eigenverantwortlich zu bearbeiten, sowie bereit und fähig, sich weitere Qualifikationen anzueignen, teamorientiert zu arbeiten, Gruppenprozesse zu moderieren und zu steuern, Fachwissen in Bezug auf die Lernbedürfnisse aufzuarbeiten, zu reflektieren und zu vermitteln.\n","lehrinhalte":"Die Lehrinhalte variieren entsprechend der jeweiligen Aufgabenstellung. Inkludiert sind jedenfalls der Einsatz und die Verwendung der für die Aufgabenstellung adäquaten Werkzeuge. Ein Beispiel ist die Entwicklung eines Dokumentenverwaltungssystems unter Verwendung eines objektrelationalen Datenbankverwaltungssystems mit XML-Unterstützung oder eines nativen XML-Datenbankverwaltungssystems. Im Rahmen der Projektdurchführung werden der praktische Einsatz von Führungs-, Verhandlungs-, Konfliktlösungstechniken, Teamorganisation, Kommunikations- und Moderationstechniken sowie Techniken des selbstorganisierten Wissenserwerbs vermittelt.\n","beurteilung":"Zur Beurteilung werden sämtliche Projektergebnisse heran gezogen, wie Zwischen- und Endpräsentationen, Dokumentation, und Systemimplementierung. Es werden sowohl Team- als auch Einzelleistungen beurteilt.\n","sonstiges":null,"voraussetzungen":null,"methoden":"Sowohl die Aufgabenstellung als auch Lösungsidee werden vorgegeben. Die Studierenden arbeiten in Teams von 3 bis 5 Personen. Jedes Team entwirft und implementiert unter Anleitung der\/des LehrveranstaltungsleiterIn eine eigene Lösung. Die Studierenden präsentieren nach jeder abgeschlossenen Projektphase ihre Zwischenergebnisse und stellen diese im Plenum zur Diskussion.\n","literatur":"Die Aufgabenstellungen der angebotenen Praktika variieren von Semester zu Semester. Die projektrelevante Literatur muss von den Studierenden selbst besorgt werden, sie werden dabei von einem vom Institut zur Verfügung gestellten Literaturserver inklusive Zugriff auf digitale Bibliotheken wie zum Beispiel ACM, IEEE und SpringerLink unterstützt.\n<\/p>\n<p class='vspace'>Einstiegsliteratur: \n<\/p><ul><li>Kuster, J.; Huber, E.; Lippmann, R.; Schmid, A.; Schneider, E.; Witschi, U.; Wüst, R.: Handbuch Projektmanagement. Springer Verlag, 2007. \n<\/li><li>Oestereich, B.; Weiss, C.: APM - Agiles Projektmanagement: Erfolgreiches Timeboxing für IT-Projekte. dpunkt.Verlag, 2007.\n<\/li><li>Hindel, B.; Hörmann, K.; Müller, M.; Schmied, J.: Basiswissen Software-Projektmanagement: Aus- und Weiterbildung zum Certified Professional for Project Management nach iS-QI-Standard. dpunkt.Verlag, 2009. \n<\/li><li>Patzak, G.; Rattay, G.: Projektmanagement: Leitfaden zum Management von Projekten, Projektportfolios und projektorientierten Unternehmen. Linde Verlag, 2008.\n<\/li><\/ul>","equivalent":null,"children":[]}