{"id":"7260","code":null,"pagename":"CurriculumWirtschaftsinformatikM02008W.LVDecisionSupportInProductionLogisticsAndSupplyChainManagementSE","type":"3","ects":"3","verantname":"Karl Doerner","verantemail":"karl.doerner@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7260","wst":"0","teilungsziffer":"0","zuteilung":"1","lvtyp":"11","wechselnd":"1","sprache":"1","langname":"Deutsch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Decision Support in Production, Logistics and Supply Chain Management","headtitle":"Decision Support in Production, Logistics and Supply Chain Management","ziele":"Die Studierenden besitzen Kenntnis über die aktuelle wissenschaftliche Literatur ausgewählter Themen des Fachgebietes Produktion und Logistik. Sie können die wissenschaftliche Literatur im Rahmen einer Gruppenarbeit zusammenfassen und präsentieren. Sie besitzen grundlegende Kenntnisse ausgewählter Softwaresysteme, Modellierungssprachen bzw. Lösungsverfahren für die Entscheidungsunterstützung in Produktion, Logistik und Supply Chain Management. Sie sind in der Lage, diverse Planungssituationen mittels geeigneter Software zu behandeln und die Ergebnisse zu interpretieren.\n","lehrinhalte":"Es werden zwei Varianten des Seminars angeboten:<br \/>Würfelseminar und Implementierungsseminar\n<\/p>\n<p class='vspace'>Im Würfelseminar wird nach einer Einführung in das wissenschaftliche Arbeiten (korrektes Zitieren, Quellen für Literatursuche, Plagiate) sowie die notwendigen Grundlagen der mathematischen Modellierung erarbeitet, wie ein Literaturartikel in eine aussagekräftige Präsentation umgesetzt werden kann. Anschließend werden die Studierenden selbst Foliensätze zu vorgegebenen Literaturartikeln erstellen und im Würfelteil präsentieren (nach dem Zufallsprinzip ausgewählt). Des Weiteren ist eine schriftliche Seminararbeit zu verfassen, welche am Ende des Semesters ebenfalls präsentiert wird.\n<\/p>\n<p class='vspace'>Im Implementierungsseminar wird in den ersten Einheiten eine Einschulung in die Verwendung des mathematischen Solvers FICO Xpress zur Lösung von Modellen zur Entscheidungsunterstützung abgehalten. Anschließend wird in Gruppenarbeit eine Seminararbeit erstellt, im Rahmen derer selbständig eine gegebene Problemstellung als Xpress-Modell implementiert und anhand von Daten getestet und analysiert wird. Die Ergebnisse der Seminararbeit sind anschließend im Rahmen einer Gruppenpräsentation den anderen Studierenden zu präsentieren.\n","beurteilung":"Seminararbeit und Seminarvortrag\n","sonstiges":null,"voraussetzungen":null,"methoden":"Seminararbeit und Seminarvortrag, Diskussion\n","literatur":"Rezente Literatur wird in jedem Semester bekannt gegeben.   \n","equivalent":null,"children":[]}