{"id":"5740","code":"2WGBGWIK","pagename":"CurriculumWirtschaftsinformatikB02008W.LVGeschlechtUndWirtschaftsinformatikKS","type":"3","ects":"3","verantname":"Ilona Horwath","verantemail":"ilona.horwath@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"5740","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Sozialwissenschaften","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 3. Jahr","levelshort":"B3","title":"Geschlecht und Wirtschaftsinformatik","headtitle":"Geschlecht und Wirtschaftsinformatik","ziele":"Siehe <a class='wikilink' href='https:\/\/lss.jku.at\/wiki\/index.php\/CurriculumWirtschaftsinformatikB02008W\/FachSozialeUndGeschlechterspezifischeAspekteDerIT'> Soziale und geschlechterspezifische Aspekte der IT<\/a>\n<\/p>\n<p class='vspace'>Der Kurs ist Teil des Moduls „Basiskompetenz soziale und geschlechterspezifische Auswirkungen der IT“. Inhaltlich knüpft er an die Themen  der VO „Soziale Auswirkungen der IT“ an und stellt die jeweils geschlechtsspezifischen Aspekte in den Vordergrund. Studierende werden dadurch befähigt,  geschlechtspezifische Einflüsse und Auswirkungen der IT systematisch zu reflektieren und im eigenen Arbeitsumfeld zu berücksichtigen. \n","lehrinhalte":"Siehe <a class='wikilink' href='https:\/\/lss.jku.at\/wiki\/index.php\/CurriculumWirtschaftsinformatikB02008W\/FachSozialeUndGeschlechterspezifischeAspekteDerIT'> Soziale und geschlechterspezifische Aspekte der IT<\/a>\n<\/p>\n<p class='vspace'>Der Kurs bietet eine Einführung in die wichtigsten Theorien zum Zusammenhang von Geschlecht und IT. Zunächst erfolgt eine Einführung in die wissenschaftliche Kategorie Geschlecht und zentrale theoretische Perspektiven. Anschließend werden verschiedene geschlechterrelevante Aspekte der IT theoretisch und empirisch beleuchtet.\n","beurteilung":"Siehe <a class='wikilink' href='https:\/\/lss.jku.at\/wiki\/index.php\/CurriculumWirtschaftsinformatikB02008W\/FachSozialeUndGeschlechterspezifischeAspekteDerIT'> Soziale und geschlechterspezifische Aspekte der IT<\/a>\n<\/p>\n<p class='vspace'>Mitarbeit, Essay, Klausur; \n","sonstiges":"Siehe <a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftsinformatikB02008W\/FachSozialeUndGeschlechterspezifischeAspekteDerIT'> Soziale und geschlechterspezifische Aspekte der IT<\/a>\n","voraussetzungen":null,"methoden":"Vortrag (theoretische Inputs mit anschließender Reflexion und Diskussion), Referate auf freiwilliger Basis, Medien (Film, Bildmaterial, Tonmaterial), nach Möglichkeit praxisrelevante Exkursionen und Gastvorträge, Reflexion (systematische Auseinandersetzung mit einem Thema, Text oder Fragestellung auf Basis der in der LV erworbenen theoretischen Kenntnisse).\n","literatur":"Basisliteratur: \n<\/p><ul><li>Bell, D.: An Introduction to Cybercultures. Routledge, London\/New York, 2001.\n<\/li><li>Bell, D.: Cyberculture Theorists. Manuel Castells and Donna Haraway. Routledge, London\/New York, 2008.\n<\/li><li>Castell, M.: Die Internet Galaxie. Internet, Wirtschaft und Gesellschaft. Verlag für Sozialwissen-schaften, Wiesbaden, 2005.\n<\/li><li>Degele, N.: Einführung in die Techniksoziologie. Fink UTB, München, 2002.\n<\/li><li>Döring, N.: Sozialpsychologie des Internet: Bedeutung des Internet für Kommunikationsprozes-se, Identitäten, soziale Beziehungen und Gruppen, Hogrefe, Göttingen, in der aktuellen Auflage.\n<\/li><li>von Gross, F.; Marotzki, W.; Sander, U. (Hrsg.): Internet – Bildung – Gemeinschaft. Verlag für Sozialwissenschaften, Wiesbaden, 2008. \n<\/li><li>Hanappi-Egger, E. (Hrsg.): women@work. Informations- und Kommunikationstechnologien als Beschäftigungsfeld aus der Sicht von Frauen. Österreichische Computergesellschaft, Wien, 2004.\n<\/li><li>Heinrich-Böll-Stiftung und Feministisches Institut (Hrsg.): feminist_spaces. Frauen im Netz. Dis-kurse-Communities-Visionen. Ulrike Helmer Verlag, Königstein\/Taunus, 2002.\n<\/li><li>Hoffmann, U.: Computerfrauen: Welchen Anteil haben Frauen an Computergeschichte und –arbeit? Rainer Hampp Verlag, München, in der aktuellen Auflage.\n<\/li><li>Lerman, N. E.; Oldenziel, R.; Mohun, A. P. (Eds.): Gender &amp; Technology. A Reader. The John Hopkins University Press, Baltimore\/London, 2003.\n<\/li><li>Siefkes, D.; Eulenhöfer, P.; Stach, H.; Städtler, K. (Hrsg.): Sozialgeschichte der Informatik. Kul-turelle Praktiken und Orientierungen. Deutscher Universitätsverlag, Wiesbaden, 1998.\n<\/li><li>Wajcman, J.: TechnoFeminism. Polity Press, Cambridge\/Malden, 2005.\n<\/li><li>Zorn, I.; Maass, S.; Rommes, E.; Schirmer, C.; Schlehowe, H. (Eds.): Gender designs IT. Const-ruction and Deconstruction of Information Society Technology. Verlag für Sozialwissenschaften, Wiesbaden 2007.<br \/>\n<\/li><\/ul><p class='vspace'>Ergänzungsliteratur wird in jedem Semester bekannt gegeben.\n","equivalent":null,"children":[]}