{"id":"5427","code":"2IMGTIBPR","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVInternationalBusinessProjectSE","type":"3","ects":"6","verantname":"Tina Ambos","verantemail":"tina.ambos@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"5427","wst":"3","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"1","sprache":"2","langname":"English","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Diploma programme","curriculumname":"Diploma programme <sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Wirtschaftswissenschaften 2009W","fachbereichname":"Business Administration","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Diploma programme","levelshort":"D","title":"Master Seminar International Business Project","headtitle":"Master Seminar International Business Project","ziele":"-\tTo make students familiar with today’s business world, which is becoming more and more global and also virtual.<br \/>-\tTo provide students with a learning environment that allows for experiencing the benefits and challenges of multicultural and virtual team work, and to give them a chance to reflect on these experiences.<br \/>-\tTo enable students to acquire a holistic picture of activities and their consequences of an internationally operating production company by participating in an online business simulation over different time zones.<br \/>-\tTo give students the opportunity to acquire skills required for virtual collaboration, by both participating in virtual teams and by having seminars over web conferences.<br \/>-\tTo provide a better understanding of different issues regarding internationalization from different perspectives.\n","lehrinhalte":"Challenges of Virtual Collaboration<br \/>Virtual Shift Work and its consequences<br \/>Collaboration and Coordination in Virtual Teams<br \/>Creativity and Innovation &amp; Virtuality<br \/>Leadership in Virtual Teams<br \/>Culture and Virtuality\nThe Future of Virtual Collaboration<br \/>Digital Divide \n","beurteilung":"Group Project incl. Reflective Essays and Group Work<br \/>Short Tests<br \/>Individual Essays\nCase Study\n","sonstiges":null,"voraussetzungen":null,"methoden":"Classroom Discussion<br \/>Individual and Group Reflexions<br \/>Online Business Simulation over different time zones<br \/>Online class via webconferencing tool<br \/>Group Tasks\n","literatur":"<ul><li>Panteli, N. &amp; Tucker, R. (2009) Power and Trust in Global Virtual Teams. Communications of the ACM. 52 (12). 113-115.\n<div class='vspace'><\/div><\/li><li>Williams, K.D., Cheung, C.K.T. &amp; Choi, W. (2000) Cyberostracism: Effects of Being Ignored Over the Internet. Journal of Personality and Social Psychology. 79 (5). 748-762.\n<div class='vspace'><\/div><\/li><li>Kock, N. (2005) Media Richness or Media Naturalness? The Evolution of Our Biological Communication Aparatus and Its Influence on Our Behavior Toward E-Communication Tools. IEEE Transactions on Professional Communication. 48 (2). 117-130.\n<div class='vspace'><\/div><\/li><li>O´Leary, M.B. &amp; Cummings, J.N. (2007) The Spatial, Temporal and Configurational Characteristics of Geographic Dispersion in Teams. MIS Quarterly. 31(3). 433-452.\n<div class='vspace'><\/div><\/li><li>Cummings, J.N. (2011) Geography is Alive and Well in Virtual Teams. Communicatino of the ACM. 54 (8). 24-26.\n<div class='vspace'><\/div><\/li><li>Letaief, R., Favier, M. &amp; Coat, F. (2006) Creativity and the Creation Process in Global Virtual Teams: Case Study of the Intercultural Virtual Project. AIM Conference 2006 (Association Information and Management). 242-258.\n<div class='vspace'><\/div><\/li><li>Chamakiotis, P., Dekoninck, E.A. &amp; Panteli, N. (2010) Creativity in Virtual Design Teams. International Design Conference – Design 2010. 1035-1044.\n<div class='vspace'><\/div><\/li><li>Lähteenmäki, S., Saarinen, E., Fischlmayr I.C. &amp; Lainema, T. (2009) Virtual Organizations. In: Bidgoli, H. (Ed.) The Handbook of Technology Management. pp. 189-206. Oxford, UK: Wiley. \n<div class='vspace'><\/div><\/li><li>Holtbrügge, D. &amp; Schillo, K. (2007) Intercultural Training Requirements for Virtual Assignments: Results of an Explorative Empirical Study. LASER Labor and Socio-Economic Research Center, University of Erlangen-Nürnberg. Paper No. 10. \n<div class='vspace'><\/div><\/li><li>Herther, N. K. (2009) Digital Natives and Immigrants. What Brain Research Tells Us. Online, Nov\/Dec 2009. 15-21.\n<div class='vspace'><\/div><\/li><li>Fischlmayr, Iris C. (2011) “Who can take over the first shift?” – Acquiring knowledge, skills and competences for virtual collaboration through an online business simulation over different time zones. Proceedings of the 4th International Conference on Student Mobility and ICT. 19-25.\n<\/li><\/ul>","equivalent":null,"children":[]}