{"id":"5896","code":"1BMARKK","pagename":"CurriculumWirtschaftswissenschaftenB1.LVMarketing","type":"3","ects":"2","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":"Business and Economics","currversion":"2013W","lv_id":"5896","wst":"1","teilungsziffer":"100","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftswissenschaften 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1S","title":"Marketing","headtitle":"Marketing","ziele":"Die Lehrveranstaltung vermittelt die Basiskenntnisse des Marketing als modernes Unternehmenskonzept. Die Studierenden sollen nach erfolgreichem Absolvieren des Kurses in der Lage sein, die wesentlichen Entwicklungen und Konzepte des Marketing zu verstehen. Aufbauend auf das Grundverständnis können die Studentinnen und Studenten Marketingmanagement-Konzepte in den Zusammenhängen begreifen, (verhaltens)leitende Prinzipien verstehen und weiterführende Überlegungen für den Einsatz von Instrumenten zur Marktbearbeitung in der Praxis anstellen. Dies erfolgt unter bestimmten Verhaltensannahmen und nicht beeinflussbaren Faktoren, von denen der Marketer bei Arbeit auszugehen hat. \n","lehrinhalte":"Entwicklung und Konzept des Marketing, Entwicklung des Marketingbegriffs, Merkmale des modernen Marketing und Marketingmanagements, institutionelle Besonderheiten des Marketingmanagements, Agenden und Prozesse der Marketingforschung, STP-Marketing, Marktsegmentierung, Auswahl von Zielgruppen, Strategien der Marktbearbeitung, Planung von Marketingstrategien abnehmergerichtet und wettbewerbsorientiert, Ziele und Entscheidungen in der Produkt- und Programmpolitik, in der Preispolitik, Ziel- und Entscheidungstatbestände in der Kommunikations- und Distributionspolitik, E-Marketing und seine Besonderheiten. \n","beurteilung":"Klausur und Nachklausur\n","sonstiges":null,"voraussetzungen":"keine\n","methoden":"Vortrag, Diskussion, Mini-Fallstudien, Praktikervorträge, Exkursionen\n","literatur":"Reader, Foliensätze, Meffert, H., Marketing, neueste Auflage; Kotler\/Bliemel, Marketing-Management, neueste Auflage\n","equivalent":null,"children":[]}