{"id":"5424","code":"2IMGTATGS","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVAdvancedTopicsInGlobalStrategicManagementIK","type":"3","ects":"3","verantname":"Tina Ambos","verantemail":"tina.ambos@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"5424","wst":"1","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"2","langname":"Englisch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Diplomstudium","curriculumname":"Diplomstudium Wirtschaftswissenschaften 2009W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Diplom","levelshort":"D","title":"Master Seminar Advanced Topics in Global Strategic Management","headtitle":"Master Seminar Advanced Topics in Global Strategic Management","ziele":"By the end of this course, the student should possess an understanding of the process of globalization of companies, be acquainted with the current thinking and practices in formulation global strategies and able to evaluate globalization strategies.\n","lehrinhalte":"The course addresses the challenges of formulating and implementing strategy in companies that are active in business on a global scale. As such it incorporates important recent developments in strategy research that bring a broad perspective to issues of scope advantage and corporate strategy in a global business environment, with a particular emphasis on emerging markets. Key issues covered include:\n<\/p>\n<p class='vspace'>-Business Model Innovation, Global Business Strategies and Emerging Market Companies: Concepts and Cases; The Future of Global Business Strategies\n<\/p>\n<p class='vspace'>The course challenges students with case-work and in-class discussion exercises that stimulate strategic decision-making in firms.\n","beurteilung":"Case Presentation &amp; Written Summary 30%; Class Participation 10%; Written Exam\t\n","sonstiges":null,"voraussetzungen":null,"methoden":"The course is experience-oriented, but is necessarily backed up by essential theory. Class-sessions are seminar style with students responsible for discussing scheduled materials. The course will combine lectures by the instructor with in-class discussions, case analysis and team presentations. \n<\/p>\n<p class='vspace'>The theory and key concepts of global management will be provided primarily by the main textbook. Thus, each class will involve assigned readings and cases. Additionally, since the course assumes that skills gained in the classroom can transfer to the „real world“, there is a strong emphasis on the analysis of complex international business problems through the preparation and discussion of a variety of cases.\n<\/p>\n<p class='vspace'>Competing Case assignments will be given to students and these take the form of a class-presentation of cases. The case assignments consist of two parts: a written case report (1000 words) and the actual presentation.\n","literatur":"Main Textbook:\n-Rugman, A.\/Collinson, S.: International Business, 5th ed., (Prentice Hall 2009) (www.pearsoned.co.uk\/rugman)\n<\/p>\n<p class='vspace'>Course Readings:\nKhanna\/Palepu: Emerging Giants – Building World Class Companies in Emerging Markets;\nBryce\/Dyer: Strategies to Crack Well-Guarded Markets;\nGhemawat: Regional Strategies for Global Leadership;\nKhanna\/Palepu: Why Focused Strategies might be wrong for Emerging Markets;\nDyer\/Kale\/Singh: How to make Strategic Alliances Work;\nPaine et al.: Up to Code - Does your Company’s Conduct meet World-Class Standards.\n<\/p>\n<p class='vspace'>Cases:\nSouth African Breweries;\nLenovo in 2005;\nEnron and the Dabhol Power Company.\n<\/p>\n<div class='vspace'><\/div>","equivalent":null,"children":[]}