{"id":"5896","code":"1BMARKK","pagename":"CurriculumWirtschaftswissenschaftenB1.LVMarketing","type":"3","ects":"2","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":"Business and Economics","currversion":"2013W","lv_id":"5896","wst":"1","teilungsziffer":"100","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"German","lvtypname":"Course","lvtypshort":"KS","zuteilungname":"Assignment according to priority","currtypename":"Bachelor's programme","curriculumname":"Bachelor's programme Business and Economics 2013W","fachbereichname":"Business Administration","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Bachelor's programme 1. year","levelshort":"B1S","title":"Marketing - An Introduction","headtitle":"Marketing - An Introduction","ziele":"The course explores base knowledge marketing concepts as a modern business concept. After successful completion of the course, students should be in a position to understand essential developments and concepts of marketing. Students can build on this base knowledge and will be in a position to comprehend correlations in marketing-management concepts, understand (behavioral) led principles, and apply forward thinking solutions in real-world marketing situations. This follows under certain behavioral assumptions and non-influenceable factors to be explored in detail by marketers.\n","lehrinhalte":"Development and concept of marketing, development of marketing concepts, characteristics of modern marketing and marketing management, institutional features of marketing managements, agendas and procedures of market research, STP marketing, market segmentation, selecting target groups, strategic handling of the markets, planning market strategies aimed at buyers and competition, objectives and decisions in product, decision and pricing policies, goal and decisions made regarding communication and distribution policies, special features of e-Marketing.\n","beurteilung":"Examination and re-sit examination\n","sonstiges":null,"voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>keine\n","methoden":"Lecture, discussion sessions, mini case studies, presentations by external lecturers, excursions\n","literatur":"Reader, PP slides, Meffert, H., Marketing, most recent edition; Kotler\/Bliemel, Marketing-Management, most recent edition\n","equivalent":null,"children":[]}