{"id":"2917","code":"2VTMMKTK2","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVMikroökonomischeTheorieIIKS","type":"3","ects":"4","verantname":"Joseph Francois","verantemail":"joseph.francois@jku.at","changedate":"2012-02-14 00:00:00","version":"2011W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"2917","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"2","langname":"English","lvtypname":"Course","lvtypshort":"KS","zuteilungname":"Assignment according to priority","currtypename":"Diploma programme","curriculumname":"Diploma programme <sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Wirtschaftswissenschaften 2009W","fachbereichname":"Economics","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Diploma programme","levelshort":"D","title":"Microeconomics II","headtitle":"Microeconomics II","ziele":"The course aims to introduce students to the microeconomic modelling of producer and consumer behaviour at a level approriate for MA studies. Ideally, students will have attended an introductory course on Mathematical Methods of Economic Theory before entering this course, or will have been equivalently prepared. The course is primarily focused on optimal behaviour of producers and consumers. In addition, the course aims at an understanding of strategic interdependencies between individual firms under different forms of competition. All of this leads us to a mapping of firms and households interaction on goods and factor markets. Most importantly, it allows us to identify conditions under which the coordination of such decentralized decision making through the market mechanism yields an optimal outcome and to explore policy options if these conditions are violated.\n","lehrinhalte":"Optimal decision of producers under given technology and given input and output prices - impact of price changes on firm behaviour (goods supply, input demand). Optimal consumption decisions by households under given preferences, and under given income and goods prices - impact of price changes on consumption behaviour (goods demand, factor supply). Measuring the impact of price and income changes on households' utility. Aggregation: moving from the level of individual firms and households to the level of an entire economy. Coordination of household and firm decisions: price mechanism and optimality of the market outcome under perfect competition. Violation of optimality through market power. Individual decision making and market efficiency under information\nasymmetries and uncertainty.\n","beurteilung":"Grading for the lecture section (239101KS) will be based on:<br \/>- midterm examination (47.5%)<br \/>- final examination (47.5%)<br \/>- participation (5%)<br \/>TOTAL: 100%<br \/>minimum passing grade is 51%.\n","sonstiges":null,"voraussetzungen":null,"methoden":"The course involves lectures, readings, and applied exercises.\n","literatur":"Hal R. Varian, Microeconomic Analysis, Verlag: Norton &amp; Company; Auflage: 3. A. <br \/>Language: English<br \/>ISBN-10: 0393957357<br \/>ISBN-13: 978-0393957358<br \/>NOTE: the above link takes you to the Amazon.de listing for the book.<br \/><br \/><br \/>EXTRAs:<br \/>note on mathematical notation<br \/>Dixit and Norman technical annex\n<\/p>\n<div class='vspace'><\/div>","equivalent":null,"children":[]}