{"id":"7256","code":"926LOMA13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachLogisticsManagement","type":"1","ects":"12.18.24","verantname":"Karl Dörner","verantemail":"karl.doerner@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Logistics Management","headtitle":"Logistics Management","ziele":"Die Studierenden besitzen vertiefte Kenntnisse in Logistics Management, die auf den Grundlagen der Wirtschaftswissenschaften aufbauen und ihnen ermöglichen, gemeinsam mit BetriebswirtInnen Informationssysteme im Bereich Produktion und Logistik zu entwickeln und einzusetzen.\n<\/p>\n<p class='vspace'>Die Studierenden sind mit den wesentlichen Aspekten der Entwicklung und Bewertung von Strategien im Bereich des Produktions- und Logistikmanagements sowie möglichen Optionen bei der Ausgestaltung von Produkten und Produktionssystemen vertraut. Sie kennen Planungsaufgaben und -methoden des operativen Produktions- und Logistikmanagements und können diese zur Lösung von typischen Problemen aus der Praxis heranziehen. Die Studierenden können Methoden im strategischen, taktischen und operativen Produktions- und Logistikmanagement sowie im Transportmanagement gezielt einsetzen und Aufgabenstellungen des Supply Chain Managements analysieren. Sie sind befähigt, ihre Kenntnisse bei der Bearbeitung von Fallstudien, in Planspielen und mit Unterstützung von Planungssoftware einzusetzen.\n","lehrinhalte":"Die Lehrinhalte variieren in Abhängigkeit von den gewählten Lehrveranstaltungen. Siehe bei den untergeordneten Lehrveranstaltungen.\n","beurteilung":null,"sonstiges":"Die Lehrveranstaltungen \"Produktion\" (3 ECTS) und \"Logistik und Supply Chain Management\" (3 ECTS) aus dem Bachelorstudium Wirtschaftswissenschaften sind Voraussetzung für die Masterlehrveranstaltungen dieses Faches und können gleichfalls gewählt werden, falls sie im Bachelorstudium noch nicht absolviert wurden.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41111},{"id":41112},{"id":41113},{"id":41114}]}