{"id":"2408","code":"979FASK11","pagename":"CurriculumFinanceAndAccountingM1.FachSpezielleFinanceAndAccountingKenntnisse","type":"1","ects":"24","verantname":"Roman Rohatschek","verantemail":"Roman.Rohatschek@jku.at","changedate":"2011-07-04 00:00:00","version":"2011W","currname":"Finance and Accounting","currnameeng":"Finance and Accounting","currversion":"2011W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Finance and Accounting 2011W","fachbereichname":"Betriebswirtschaftslehre","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Spezialkenntnisse in Finance and Accounting","headtitle":"Spezialkenntnisse in Finance and Accounting","ziele":"Die Studierenden erlangen das spezielle Fachwissen aus dem Bereich Finance and Accounting im engeren Sinne ergänzt um Bereiche des Controlling and Management Accounting, Tax und Public and Nonprofit Management.\n","lehrinhalte":"Aufbauend auf die Inhalte der jeweiligen Teilprüfungen im Fach \"Grundlagen Finance and Accounting\" werden die Inhalte aus dem Kernbereich \"Finance\" um Spezialfälle der Finanzierung sowie Bankbetriebslehre erweitert. Aus dem Kernbereich \"Accounting\" werden die Kenntnisse des IFRS um Sonderfragen (inkl Konsolidierung) vertieft sowie ausgehend von der Abschlussanalyse die Methoden der Unternehmensbewertung vermittelt. Neben diesen Kernbereichen werden Bereiche aus Besteuerung von Unternehmen bei Gründung, Umgründung und Beendigung, Controlling &amp; Business Intelligence sowie Public and Nonprofit Finance behandelt. Darüber hinaus sind in diesem Fach die Forschungsmethoden für Finance and Accounting zu vermitteln.\n","beurteilung":"Die Gesamtnote des Faches ergibt sich aus dem gewichteten Durchschnitt der Lehrveranstaltungsprüfungen.\n","sonstiges":null,"voraussetzungen":"Die Zulassungvoraussetzungen sind bei den einzelnen Lehrveranstaltungen festgelegt.\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41086},{"id":41087},{"id":41088},{"id":41089},{"id":41090},{"id":41091},{"id":41092},{"id":41093},{"id":41094}]}