{"id":"6576","code":"921CINS13","pagename":"CurriculumInformatikM02007W.FachIntelligentInformationSystemsCS","type":"1","ects":"0-27","verantname":"Hanspeter Mössenböck","verantemail":"Hanspeter.Moessenboeck@jku.at","changedate":"2013-07-05 00:00:00","version":"2013W","currname":"Computer Science","currnameeng":"Computer Science","currversion":"2013W","pruefungname":"Structure","currtypename":"Master's programme","curriculumname":"Master's programme Computer Science 2013W","fachbereichname":"Computer Science","typename":"Subject","uniname":"Johannes Kepler University Linz","levelname":"Master's programme","levelshort":"M","title":"Intelligent Information Systems (CS) ","headtitle":"Intelligent Information Systems (CS) ","ziele":"The large amounts of structured, unstructured, or multimedia data produced in various domains, especially the World Wide Web, require intelligent strategies for analysis, semantic modeling, processing, retrieval, extraction, and integration of information. Intelligent information systems require engineering approaches, concepts, methods, and tools for information and services provided in a machine-interpretable way. This includes areas like relational databases, web information systems, non-standard storage, (Web) search strategies, data and web mining, social\/semantic web intelligence, pattern recognition, artificial intelligence, recommendation systems, personalized and context-aware systems, and cooperative situation awareness. Additionally, eAccessibility and assistive technologies have become key aspects of intelligent information systems. The specialization in Intelligent Information Systems aims at conveying these competences and skills. \n","lehrinhalte":"The contents of this subject result from the contents of its courses. \n","beurteilung":null,"sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41139},{"id":41140},{"id":41141},{"id":41142},{"id":41143},{"id":41144},{"id":41145},{"id":41146},{"id":41147}]}