{"id":"5552","code":"973GMCPORG10","pagename":"CurriculumGeneralManagementM1.ModulOrganization","type":"2","ects":"6","verantname":"Johannes Lehner","verantemail":"johannes.lehner@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","pruefungname":"Course examination","currtypename":"Master's programme","curriculumname":"Master's programme General Management 2013W","fachbereichname":"Business Administration","typename":"Module","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Organization","headtitle":"Organization","ziele":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup><ul><li>Aufbauend auf Grundlagenwissen zu Organisationsstrukturen und zu Verhalten in Organisationen (repräsentiert durch die Lehrbücher wie Schreyögg \"Organisation\" und Daft\/Noe zu \"Organizational Behavior\") ist es Ziel dieses Moduls, die Fähigkeit zu entwickeln dieses Wissen vor dem Hintergrund wissenschaftlicher Ergebnisse kritisch zu hinterfragen, anzuwenden und weiterzuentwickeln. Dazu dienen weiters folgende Ziele:\n<\/li><li>Die Studierenden kennen die wichtigsten wissenschaftlichen Ansätze (Paradigmen) der Erklärung und Gestaltung von Organisationen; sie können diese hinsichtlich ihres Erkenntnisgehalts und ihrer praktisch normativen Implikationen kritisch reflektieren und für eigenständiges Denken und Handeln nutzen. \n<\/li><li>Die Studierenden lernen und verstehen wissenschaftliche Ansätze geschlechterorientierter Organisation.\n<\/li><li>Die Studierenden können sich wissenschaftliche Originaltexte selbständig erschließen; sie sind in der Lage, komplexe, abstrakte Argumente analytisch zu durchdringen; sie verfügen über die Fähigkeit, zwischen in sich konsistenten aber einander widersprechenden (organisationstheoretischen) Perspektiven flexibel zu wechseln.\n<\/li><\/ul>","lehrinhalte":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Basic concepts of Organizational Structures and Organizational Behavior are repeated through reading and discussing articles by leading scholars. Because these articles are on an advanced level, they require students to additionally consult text books, dependent on their prior mastery of the introductory level.\n<\/p><ul><li>Concepts are:\n<ul><li>Cognitive Processes and Sensemaking\n<\/li><li>Attribution\n<\/li><li>Motivation\n<\/li><li>Criteria of effectiveness\n<\/li><li>Configuration, contingency and life-cycles of organizations\n<\/li><\/ul><\/li><li>Based on this, advanced organizational theories will be read and discussed:\n<ul><li>System theory and loose coupling\n<\/li><li>Institutionalism and Population Ecology\n<\/li><li>Transaction cost Theory\n<\/li><li>Agency Theory\n<\/li><li>Resource-dependency, Resource- and capabilities based concepts\n<\/li><li>Political organization, power and hierarchy\n<\/li><\/ul><\/li><\/ul>","beurteilung":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>First Exam (60 points), Second Exam (90 points), out of this a minimum of 75 points has to be reached.\nActive Participation (15 bonuspoints, do apply only if minimum from exams is reached).\nAttendance at course times is encouraged, but not mandatory.\n","sonstiges":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Goals:\n<\/p><ul><li>Students have knowledge of the most important theoretical approaches for description, explanation of phenomena in organizations and on management based on these theories. They are able to critically judge these theories in regard to their implications for management. Most importantly, this shall provide students with the ability to advance knowledge in this regard and to adapt their behavior to the needs in their future work.\n<\/li><li>Students are increasingly aware of gender specific aspects of organizations.\n<\/li><li>Students are able to read, understand, and judge advanced research articles, thereby have the ability to comprehend complex relationships as they appear in organizations and in management in general.\n<\/li><\/ul>","voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>keine\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41103}]}