{"id":"7243","code":"2WSWIES","pagename":"CurriculumWirtschaftsinformatikM02008W.LVInformationEngineeringSE","type":"3","ects":"3","verantname":"Friedrich Roithmayr","verantemail":"friedrich.roithmayr@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7243","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Information Engineering","headtitle":"Information Engineering","ziele":"Die Studierenden können das in den Basis-, Kern- und Spezialkompetenz vermittelnden Studienfächern erworbene Wissen und die entwickelten Fähigkeiten zur Lösung von praktischen oder wissenschaftlichen Problemstellungen der Wirtschaftsinformatik anwenden. Die Studierenden sind befähigt, typische Themenstellungen aus dem Kernbereich Information Engineering selbständig zu bearbeiten. Sie können sich das dafür erforderliche, dem Stand der Technik entsprechende Spezialwissen an Hand der aktuellen Fachliteratur erarbeiten und die Arbeitsergebnisse schriftlich und mündlich professionell darstellen. Grundlegende Techniken des wissenschaftlichen Arbeitens, und zwar Literaturrecherche, strukturierte Auswertung wissenschaftlicher Arbeiten und Präsentation wissenschaftlicher Erkenntnisse werden beherrscht.\n","lehrinhalte":"Der Lehrinhalt und die thematische Ausrichtung der Lehrveranstaltung orientieren sich an den aktuellen Entwicklungen und Trends in Wissenschaft und Praxis des Information Engineering.\n","beurteilung":"Beurteilt werden die schriftliche Seminararbeit, deren Präsentation sowie die Beteiligung an Diskussion und Reflexion der Seminarthemen.\n","sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":"Die Literatur orientiert sich am gewählten Seminarthema, den Studierenden stehen dafür die entsprechenden Fachbereichsbibliotheken sowie digitale Bibliotheken wie z.B. ACM, IEEE und SpringerLink zur Verfügung. Darüber hinaus stehen die Fachbereichsbibliothek „Betriebswirtschaftslehre, Wirtschaftsinformatik und Fachsprachen“ sowie die Präsenzbibliothek des jeweiligen Instituts zur Verfügung.\n","equivalent":null,"children":[]}