{"id":"5891","code":"1BKOREK","pagename":"CurriculumWirtschaftswissenschaftenB1.LVKostenrechnung","type":"3","ects":"2","verantname":"Sonja Prell-Leopoldseder","verantemail":"sonja.prell@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":"Business and Economics","currversion":"2013W","lv_id":"5891","wst":"1","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"German","lvtypname":"Course","lvtypshort":"KS","zuteilungname":"Assignment according to priority","currtypename":"Bachelor's programme","curriculumname":"Bachelor's programme Business and Economics 2013W","fachbereichname":"Business Administration","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Bachelor's programme 1. year","levelshort":"B1S","title":"Cost Accounting","headtitle":"Cost Accounting","ziele":"Content of the course „Principles of Cost Accounting” is basically the table of accounting contents of business colleges (Handelsakademien und HBLA) and tourism schools.\nThe course’s main target is to impart basic knowledge of cost accounting fundamentals as well as the setup of the cost accounting system. After attending this lecture, students should be capable to understand cost calculation techniques and use the theoretical input provided to solve problems and assignments.\n","lehrinhalte":"<ul><li>1. Chapter: Cost accounting fundamentals\n<\/li><li>2. Chapter: Cost accounting based on full costing for production industry\n<ul><li>Cost element accounting\n<\/li><li>Cost center accounting\n<\/li><li>Cost unit accounting\n<\/li><\/ul><\/li><li>3. Chapter: Cost accounting based on direct costing for production industry\n<ul><li>Aims and purpose of cost accounting based on direct costing\n<\/li><li>Direct Costing including assignments (such as pricing decisions, break-even-analysis, product programming)\n<\/li><\/ul><\/li><\/ul>","beurteilung":"Written final exam: 45 minutes, which equals 45 possible points. \n<\/p>\n<p class='vspace'>In order to pass students need a minimum of 23 points of the final exam (50%). \n","sonstiges":"For further information please have a look at the information sheet \"Kurs Kostenrechnung\" which you find at the homepage of the Department for Controlling and Consulting: www.controlling.jku.at\n","voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>keine\n","methoden":"Theoretical basics as well as a case study will be explained through the lecturer.\nStudents will be capable to use the theoretical input provided to solve problems and assignments.\n","literatur":"Sonja Prell-Leopoldseder: Grundlagen der Kostenrechnung – Eine Einführung in die Theorie und Praxis der Kostenrechnung, Linde Verlag Wien 2010\n<\/p>\n<p class='vspace'>Reductions for students in the book-store of the students council (ÖH-Shop) or at Thalia.\n","equivalent":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Studierende, die ihre Reifeprüfung im Rahmen des Lehrplanes von kaufmännischen höheren Schulen oder von höheren Lehranstalten für wirtschaftliche Berufe, für Tourismus, für Mode und Bekleidungstechnik sowie für künstlerische Gestaltung innerhalb der letzten 6 Jahre ab Antragstellung abgelegt haben, erhalten den Kurs Kostenrechnung jedenfalls anerkannt. Sonstige Prüfungen werden im Einzelfall nach Maßgabe der Gleichwertigkeit anerkannt.\n","children":[]}