{"id":"6177","code":"2WSGAIT","pagename":"CurriculumWirtschaftsinformatikM02008W.LVSozialeUndGeschlechterspezifischeAspekteDerITKS","type":"3","ects":"3","verantname":"Ilona Horwath","verantemail":"ilona.horwath@jku.at","changedate":"2013-06-05 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"6177","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Sozialwissenschaften","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Soziale und geschlechterspezifische Aspekte der IT","headtitle":"Soziale und geschlechterspezifische Aspekte der IT","ziele":"Die Studierenden kennen vertiefende theoretische Modelle und soziale, (inter)kulturelle und geschlechterspezifische empirische Zusammenhänge zu den Themen des Moduls „Soziale und geschlechterspezifische Aspekte der IT“ (Bachelor). Sie sind in der Lage, bei Entwurf, Implementierung und Betrieb von Informationssystemen und Technikinfrastrukturen soziale und geschlechterspezifische Aspekte zu berücksichtigen.\n","lehrinhalte":"Vertiefende Aspekte der IT aus sozial- und geschlechterwissenschaftlicher Sicht, aufbauend auf den in „Soziale und geschlechterspezifische Aspekte der IT“ (Bachelor) vermittelten Inhalten.\n","beurteilung":"Klausur oder alternative gleichwertige Leistung (Referat, Seminararbeit)\n","sonstiges":"Bearbeitung theoretischer Inputs (Vortrag, Textbearbeitung) mit anschließender moderierter Diskussion, Referate, Medien (Film, Bildmaterial, Tonmaterial), nach Möglichkeit praxisrelevante Exkursionen und Gastvorträge, Reflexion (systematische Auseinandersetzung mit einem Thema, Text oder Fragestellung auf Basis der in der LV erworbenen theoretischen und empirischen Kenntnisse), Gruppenarbeiten und Ergebnispräsentation\n","voraussetzungen":"keine (die Zulassung zum Studium vorausgesetzt)\n","methoden":"Bearbeitung theoretischer Inputs (Vortrag, Textbearbeitung) mit anschließender moderierter Diskussion, Referate, Medien (Film, Bildmaterial, Tonmaterial), nach Möglichkeit praxisrelevante Exkursionen und Gastvorträge, Reflexion (systematische Auseinandersetzung mit einem Thema, Text oder Fragestellung auf Basis der in der LV erworbenen theoretischen und empirischen Kenntnisse), Gruppenarbeiten und Ergebnispräsentation\n","literatur":"Basisliteratur:\n<\/p><ul><li>Deubler-Mankowsky, A.: Lara Croft. Modell, Medium, Cyberheldin. Das virtuelle Geschlecht und seine metaphysischen Tücken. Suhrkamp, Frankfurt am Main, 2001.\n<\/li><li>Döring, N.: Sozialpsychologie des Internet: Bedeutung des Internet für Kommunikationsprozesse, Identitäten, soziale Beziehungen und Gruppen. Hogrefe, Göttingen, in der aktuellen Auflage.\n<\/li><li>von Gross, F.; Marotzki, W.; Sander, U.: Internet – Bildung – Gemeinschaft. Verlag für Sozialwissenschaften, Wiesbaden, 2008.\n<\/li><li>Lübke, V.: CyberGender. Geschlecht und Körper im Internet. Königstein\/Taunus, Ulrike Helmer Verlag, 2005.\n<\/li><li>Rosenberg, R. S.: The Social Impact of Computers. 3. Elsevier, San Diego\/London, in der aktuellen Auflage.\n<\/li><li>Wajcman, J.: TechnoFeminism. Polity Press, Cambridge\/Malden, 2005.\n<\/li><li>Willems, H.: Weltweite Welten. Internet-Figuration aus wissenssoziologischer Perspektive. Verlag für Sozialwissenschaften, Wiesbaden, 2008.\n<\/li><li>Zorn, I.; Maass, S.; Rommes, E.; Schirmer, C.; Schlehowe, H. (Eds.): Gender designs IT. Construction and Deconstruction of Information Society Technology. Verlag für Sozialwissenschaften, Wiesbaden, 2007\n<\/li><\/ul><p class='vspace'>Ergänzungsliteratur wird in jedem Semester bekannt gegeben.\n","equivalent":null,"children":[]}