{"id":"7246","code":"2WCES","pagename":"CurriculumWirtschaftsinformatikM02008W.LVCommunicationsEngineeringSE","type":"3","ects":"3","verantname":"Christian Stary","verantemail":"christian.stary@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7246","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"1","langname":"German","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme Business Informatics 2013W","fachbereichname":"Business Informatics","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Communications Engineering","headtitle":"Communications Engineering","ziele":"Students will apply base, core and specialized skills and knowledge acquired from the study of other subjects to continue developing skills in order to solve practical and theoretical problems in Business Informatics. Students will learn how to independently deal with - and manage - common problems that can arise in the core field of Communications Engineering as well as how to extract required, corresponding specialized information in technology through research. Students will also learn how to present written and oral research results in a professional manner and how to master basic techniques of academic work, including research, structured analysis of academic papers, and presenting academic\/scientific results. \n","lehrinhalte":"The course content and topics focus on current developments and trends in science and students will learn real-world applications in the field of Communications Engineering.\n","beurteilung":"Grading is not only based on how well written papers and presentations reflect each student's participation, but also on the discussions and reflection on course topics.\n","sonstiges":null,"voraussetzungen":null,"methoden":"Instructional exploration and reflection\n","literatur":"The required reading focuses on selected seminar topics and students will have access to the corresponding subject-related libraries as well as digital libraries such as ACM, IEEE and Springer.  Furthermore, students will have access to the Library of Business Administration, Business Informatics, and Business Languages as well as to on-site libraries located individually at each institute.\n","equivalent":null,"children":[]}