{"id":"5550","code":"973GMCPMAR10","pagename":"CurriculumGeneralManagementM1.ModulMarketing","type":"2","ects":"6","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","pruefungname":"Eine Lehrveranstaltungsprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Marketing","headtitle":"Marketing","ziele":"<ul><li>Die Studierenden kennen die grundlegenden wissenschaftlichen Ansätze zur Beschreibung, Erklärung und Gestaltung von Marketingentscheidungen und deren problembezogenen Voraussetzungen in der Theorie und Praxis. Die Studierenden erarbeiten einen Überblick zum Status quo und den Entwicklungen der wissenschaftstheoretischen und methodischen Diskussion innerhalb der Marketingwissenschaft in den Bereichen Konsumgüter-, Dienstleistungs- und B2B-Marketing.\n<\/li><li>Sie können sich die einschlägige Fachliteratur in den genannten Bereichen selbständig erschließen, sind in der Lage, sich kritisch mit den Originalquellen auseinanderzusetzen und eigenständige Beiträge zu schreiben und zu präsentieren. Die Studierenden verstehen die Implikationen der einzelnen Ansätze der Marketingtheorien für die Marketingpraxis und sind in der Lage, diese entsprechend zu verwerten.\n<\/li><\/ul>","lehrinhalte":"Das Modul Marketing befasst sich mit den theoretischen Grundlagen des Marketings und den Anwendungen in der Praxis. Hinzu kommen aktuelle Trends, die sich aus dem Blickwinkel der Weiterentwicklung der verschiedenen theoretischen Ansätze auseinander setzen. Im Einzelnen wird auf die verschiedenen Ansätze der deutschsprachigen und englischsprachigen Marketingwissenschaft eingegangen. Welche kontroversiellen Positionen zu einzelnen Marketingphänomenen vertreten werden und welche Aussagen hinsichtlich Fundierung und Anwendung des Marketingwissens von den Vertretern der verschiedenen Denkansätze über die Zeit hinweg getroffen wurden.\n","beurteilung":null,"sonstiges":null,"voraussetzungen":"keine\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41117}]}