{"id":"7254","code":"926FINA13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachFinanceAndAccounting","type":"1","ects":"12.18.24","verantname":"Roman Rohatschek","verantemail":"Roman.Rohatschek@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Finance and Accounting","headtitle":"Finance and Accounting","ziele":"Die Studierenden besitzen vertiefte Kenntnisse in Finance and Accounting, die auf den Grundlagen der Wirtschaftswissenschaften aufbauen und ihnen ermöglichen, gemeinsam mit BetriebswirtInnen Informationssysteme im Bereich Finance and Accounting zu entwickeln und einzusetzen.\n<\/p>\n<p class='vspace'>Die Studierenden können strategische und operative Unternehmenspläne erstellen, diese in Form von Budgets bewerten und entscheidungsrelevante Informationen erkennen. Sie sind befähigt, Bereichs- und Einzelpläne zu koordinieren sowie effiziente Kontrollsysteme einzurichten und Kostenrechnungskonzepte zu realisieren. Die Studierenden sind in der Lage, Finanz- und Liquiditätsplanungen durchzuführen und Prognose- und Analyseinstrumente für die betriebswirtschaftliche Frühwarnung einzusetzen.\n<\/p>\n<p class='vspace'>Weiters sind die Studierenden mit den Problemen der Finanzierung und Bewertung von Unternehmen vertraut. Sie können auf Basis der finanzierungstheoretischen Grundlagen Aufgabenstellungen des Wertpapiermanagements lösen und besitzen einen Überblick über die Funktionsweise von Banken. Sie sind mit Unternehmensbewertungstechniken vertraut und verfügen über die Kompetenz, bei Wirtschaftsprüfungen fachkundig mitzuwirken.\n","lehrinhalte":"Introduction to managerial accounting, cost-volume-profit analysis, contribution costing, budgeting, target costing, life cycle costing, performance measurement. \nGoals and concepts of financial reporting, corporate governance, elements of financial statements, measurement concepts in international financial reporting, international financial reporting standards (IFRS), internal control &amp; risk management.<br \/>Key theoretical and practical issues in finance: measurement of risk and return, cost of capital, equity and fixed income valuation, capital budgeting, financing decisions, financial forecasting and planning, breakeven analysis and corporate restructuring.\n","beurteilung":null,"sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41085},{"id":41095},{"id":41097},{"id":41099}]}