{"id":"7210","code":"526GLWNALD13","pagename":"CurriculumWirtschaftsinformatikB02008W.ModulAlgorithmenUndDatenstrukturen","type":"2","ects":"6","verantname":"Gustav Pomberger","verantemail":"gustav.pomberger@jku.at","changedate":"2013-08-23 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Modulprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1","title":"Algorithmen und Datenstrukturen","headtitle":"Algorithmen und Datenstrukturen","ziele":"Die Studierenden sind in der Lage, algorithmisch zu denken, mit Abstraktionskonzepten zu arbeiten, Aufgaben algorithmisch zu lösen und Algorithmen in Programme zu transformieren. Sie beherrschen sowohl den Entwurf von Algorithmen als auch die Analyse ihrer Struktur und ihres Verhaltens. Sie sind mit Methoden und Konzepten zur systematischen Programmierung und der Modellierung komplexer Datenstrukturen vertraut und kennen Algorithmen zur Lösung wichtiger Standardaufgaben.\n","lehrinhalte":"Algorithmische Grundkonzepte, Grundbegriffe und Notationsformen; Struktur und Entwurf von Algorithmen; Struktur und Entwurf elementarer und vernetzter Datenstrukturen; Datenabstraktion, abstrakte Datenstrukturen, abstrakte Datentypen; Rekursionsprinzip und rekursive Algorithmen; Komplexitätsanalyse von Algorithmen; Algorithmen mit Zufallszahlen; Sortier- und Suchalgorithmen; Algorithmen auf Zeichenketten; Geometrie- und Graphalgorithmen; Exhaustionsalgorithmen\n","beurteilung":"Siehe Beschreibung der untergeordneten Lehrveranstaltungen.\n","sonstiges":"Die Lehrveranstaltung wird in Form einer klassischen Vorlesung abgehalten. Die Studierenden erhalten dazu Materialien, die von ihnen in der Vorlesung ergänzt werden. Auf diese Weise wird den Studierenden der Entwicklungsprozess von Algorithmen vermittelt. Die Vorlesung wird durch eine begleitende Übung ergänzt.\n<\/p>\n<p class='vspace'>Die Übungsaufgaben dienen der Vertiefung des in der Vorlesung behandelten Stoffes und sollen den Studierenden die Gelegenheit bieten, zu überprüfen, ob das erworbene Wissen tatsächlich umgesetzt werden kann. Es werden in der Regel neun Übungsaufgaben ausgegeben. Einzelne Musterlösungen werden während der Übungsstunden besprochen. Zu ausgewählten Themen werden zusätzliche Aufgaben vorbereitet, die gemeinsam gelöst werden. Darüber hinaus haben die Studierenden Gelegenheit, Inhalte der Vorlesung zu reflektieren bzw. ungelöste Probleme mit den LVA-LeiterInnen zu diskutieren. Die Vorbeurteilung erfolgt durch studentische MitarbeiterInnen, die abschließende Beurteilung durch die Lehrveranstaltungsleitung.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":"{$$equivalent}\n","children":[{"id":41232},{"id":41233}]}