{"id":"7243","code":"2WSWIES","pagename":"CurriculumWirtschaftsinformatikM02008W.LVInformationEngineeringSE","type":"3","ects":"3","verantname":"Friedrich Roithmayr","verantemail":"friedrich.roithmayr@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7243","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"1","langname":"German","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme Business Informatics 2013W","fachbereichname":"Business Informatics","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Information Engineering","headtitle":"Information Engineering","ziele":"Students will learn to apply base, core and special skills acquired in other courses and develope skills to solve practical and scientific problems in the field of business informatics. Students will learn how to independently deal with common problems found in the core area of information engineering.  Students will be exposed to the latest information available through current readings and will learn how to effectively present research results (written and oral) in a professional manner. Students will learn to master basic academic techniques, such as conducting research, how to structure the evaluation of academic work as well as how to present academic\/scientific results.\n","lehrinhalte":"The course will focus on and explore current scientific and hands-on developments as well as contemporary trends in the field of Information Engineering.\n","beurteilung":"Grading will be based on a written seminar paper, student presentation, as well as active participation in class discussions and reflections on seminar topics.\n","sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":"Course readings will focus on selected seminar topics available to students at the corresponding subject libraries as well as through digital libraries (ACM, IEEE, SpringerLink). Students will also have access to the following subject libraries: \"Business Administration, Business Informatics and Languages\" as well as each institute's on-site library.\n","equivalent":null,"children":[]}