{"id":"5558","code":"973GMCPFAC10","pagename":"CurriculumGeneralManagementM1.ModulFinancialAccounting","type":"2","ects":"6","verantname":"Roman Rohatschek","verantemail":"roman.rohatschek@jku.at","changedate":"2013-04-30 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","pruefungname":"Eine Lehrveranstaltungsprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Financial Accounting","headtitle":"Financial Accounting","ziele":"Ausgehend von den Bilanzierungs- und Bewertungsmethoden in den internationalen Rechnungslegungsstandards (IFRS) werden den Studierenden die Auswirkungen unternehmerischen Handelns auf die Darstellung im Abschluss vermittelt und auf die Kommunikation im Rahmen der externen Rechnungslegung dargelegt. Die Ausbildung zielt auf die Vermittlung vom Grundverständnis des Rechnungslegungsprozesses sowie auf die analytische Fähigkeit zur Interpretation von internationalen Abschlüssen ab. Die Ausbildung richtet sich nicht an Personen, die im Rechnungswesen tätig sind. \n<\/p>\n<p class='vspace'>Durch analytische Betrachtung von Abschlüssen wird unter anderem auch auf die Performance-Messung der Unternehmung und des Managements Bezug genommen, die den Unternehmensentscheidungen zu Grunde gelegt werden. Die Analyse der Risikoberichterstattung stellt einen wesentlichen Bestandteil moderner Entscheidungsprozesse im Management dar. \n","lehrinhalte":"Goals and Concepts of Financial Reporting, Corporate Governance, Elements of Financial Statements, Measurement Concepts in International Financial Reporting, Overview of selected International Financial Reporting Standards (IFRS), Interpretation\/Analysis of Financial Statements prepared under IFRS, Performance Measurement, Internal Control &amp; Risk Management\n","beurteilung":null,"sonstiges":null,"voraussetzungen":"Keine\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41098}]}