{"id":"7228","code":"926BUSI13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachBusinessIntelligence","type":"1","ects":"6.12.18","verantname":"Michael Schrefl","verantemail":"michael.schrefl@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Business Intelligence","headtitle":"Business Intelligence","ziele":"Die Studierenden sind befähigt, inner- und zwischenbetriebliche Datenbestände zu extrahieren, bereinigen, transformieren und in ein Data Warehouse zu integrieren. Sie sind in der Lage, eine systematische Analyse von Geschäftsprozessen und Unternehmensdaten mit Hilfe von Methoden und Werkzeugen des Data Warehousing und Data Mining durchzuführen und damit Daten in Zusammenhang zueinander zu bringen und potentiell neues Wissen über häufige Muster bzw. Diskontinuitäten zu entdecken. Die Studierenden können Daten und Geschäftsprozesse mit Hilfe semantischer Methoden und Techniken so aufbereiten und gestalten, dass diese zwischen Organisationen automatisiert ausgetauscht bzw. vernetzt werden können. Sie sind folglich befähigt, auf Grund ihrer Kenntnisse in den Bereichen Data Warehousing, Data Mining und Semantischer Technologien entscheidungsunterstützende Informationssysteme zu entwerfen, zu implementieren und einzusetzen.\n","lehrinhalte":"Siehe bei den untergeordneten Modulen.\n","beurteilung":"Die in den einzelnen Modulen verwendeten Prüfungsformen variieren und sind der jeweiligen Modulbeschreibung zu entnehmen. Die Gesamtnote des Faches Business Intelligence wird gemäß § 16 Abs (1) Z 2 Satzungsteil Studienrecht (gewichtete Beurteilung der Modulprüfungen) ermittelt.\n","sonstiges":"Pflichtfach 6 ECTS, Wahlfach 0-12 ECTS\n<\/p>\n<p class='vspace'>Das Studienfach Business Intelligence kann im Ausmaß von 6, 12 oder 18 ECTS absolviert werden. Es umfasst nachfolgend angeführte Module, diese können einzeln oder in beliebiger Kombination gewählt werden.\n<\/p>\n<p class='vspace'>Wurde ein Modul im Bachelorstudium zur individuellen Vertiefung bereits absolviert, so ist aus dem Fach Business Intelligence im Masterstudium mindestens ein weiteres Modul im Ausmaß von 6 ECTS zu wählen.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41030},{"id":41033},{"id":41036}]}