{"id":"7327","code":"526SGAI13","pagename":"CurriculumWirtschaftsinformatikB02008W.FachSozialeUndGeschlechterspezifischeAspekteDerIT","type":"1","ects":"6","verantname":"Ilona Horwath","verantemail":"ilona.horwath@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Sozialwissenschaften","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 3. Jahr","levelshort":"B3","title":"Soziale und geschlechterspezifische Aspekte der IT","headtitle":"Soziale und geschlechterspezifische Aspekte der IT","ziele":"Die Studierenden sind fähig, soziale, (inter)kulturelle und geschlechterspezifische Probleme, die in Zusammenhang mit IT entstehen, auf individueller, betrieblicher und sozialer Ebene zu analysieren. Sie haben ein systematisches Wissen über die sozialen Folgen von IT und erkennen, dass Informations- und Kommunikationstechnologien soziale Interessen beeinflussen. Sie verfügen über Basiswissen zu Gesellschaft, Technologie und Geschlecht allgemein und ausgewählten Teilbereichen, wie Arbeit, Gesundheit oder sozialen Aspekten politischer Entscheidungen betreffend des Einsatzes der IT. Sie können berufliche Aktivitäten in einem systemischen Zusammenhang reflektieren.\n","lehrinhalte":"IT aus sozialwissenschaftlicher Sicht, Sozialgeschichte der IT, wechselseitige Einflüsse zwischen gesellschaftlichen (sowie sozialpsychologischen) Entwicklungen und IT-Genese (Gestaltung, Entwicklung, Anwendung); Gesellschaftliche Bilder der IT, Bildung, soziale Gruppen und Zugang zu IT, gesellschaftliche Akzeptanz von IT; Soziologische Haupttheorien über IT, Geschlechterverhältnisse und sozialer Wandel im Zusammenhang mit IT, wie technologische Kommunikation, Veränderungen individueller und persönlicher Identitäten, technologische Formation sozialer Beziehungen; Ökonomische Auswirkungen von IT, wie Wandel der IT-verursachten ökonomischen und sozialen Strukturen, Arbeitsmarkt, neuer Qualifikationsbedarf durch IT, die Rolle der IT für den wirtschaftlichen Wettbewerb; Relevante gesetzliche Regelungen, wie Mitbestimmung, Gesundheit und Sicherheit am Arbeitsplatz; Explizite Bearbeitung der jeweils geschlechtsspezifischen Aspekte und Wirkungen.\n","beurteilung":"Übernahme der Note des Moduls\n","sonstiges":"Vortrag (theoretische Inputs mit anschließender Auseinandersetzung und Diskussion), Referate auf freiwilliger Basis, Medien (Film, Bildmaterial, Tonmaterial), nach Möglichkeit praxisrelevante Exkursionen und Gastvorträge, Reflexion (systematische Auseinandersetzung mit einem Thema, Text oder Fragestellung auf Basis der in der LV erworbenen theoretischen Kenntnisse)\n","voraussetzungen":"Empfohlen: <a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftsinformatikB02008W\/FachGrundlagenDerWirtschaftsinformatik'>Grundlagen der Wirtschaftsinformatik<\/a>, <a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftsinformatikB02008W\/FachGrundlagenDerBetriebswirtschaftslehre'>Grundlagen der Betriebswirtschaftslehre<\/a>, <a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftsinformatikB02008W\/FachGrundlagenDerInformatik'>Grundlagen der Informatik<\/a>\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41279},{"id":41280}]}