{"id":"5414","code":"973SMCPTIMS10","pagename":"CurriculumGeneralManagementM1.LVMasterSeminarAdvancedTopicsInInternationalMarketingSE","type":"3","ects":"2","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","lv_id":"5414","wst":"1","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"1","sprache":"2","langname":"Englisch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Masterstudium","curriculumname":"Masterstudium General Management 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Master 2. Jahr","levelshort":"M2","title":"Master Seminar Advanced Topics in International Marketing","headtitle":"Master Seminar Advanced Topics in International Marketing","ziele":"Gaining knowledge and understanding of state-of-the-art literature; acquiring specific knowledge in current issues of international marketing and emerging markets; getting to know databases and search strategies; getting to know different types of literature and their purposes; identification of current topics in academia and business; evaluation and discussion of results. \n","lehrinhalte":"The semimar deals with current topics in advanced and emerging markets on the strategic and operational level of marketing. In the seminar, issues discussed in different types of international marketing literature are critically reflected. In groups, different literature outlets such as scientific journals and teaching materials are analysed according to previously specified topics. The state-of-the-art regarding topics in international marketing and emerging markets is presented and discussed in class. Findings of the literature analysis are also provided through a written group report. After that, a workshop integrates the results. Finally, an oral or written exam sums up the essence of the seminar. \n","beurteilung":"Participation in class, presentation, report, written or oral exam.\n","sonstiges":null,"voraussetzungen":"Positive Absolvierung der Module \n<\/p><ul><li>Strategic Management\n<\/li><li>Marketing\n<\/li><li>Organization\n<\/li><li>Human Resource &amp; Change Management\n<\/li><li>Managerial Accounting\n<\/li><\/ul>","methoden":"Discussions, quantitative and qualitative research methods, literature analysis, presentations, group work.\n","literatur":"Depends on seminar focus, basic literature will be made available.\n","equivalent":null,"children":[]}