{"id":"5334","code":"973GMCPCFIK10","pagename":"CurriculumGeneralManagementM1.LVMasterCourseFinanceKS","type":"3","ects":"6","verantname":"Helmut Pernsteiner","verantemail":"helmut.pernsteiner@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"General Management","currnameeng":"General Management","currversion":"2013W","lv_id":"5334","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"4","langname":null,"lvtypname":"Course","lvtypshort":"KS","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme General Management 2013W","fachbereichname":"Business Administration","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Master Course Corporate Finance","headtitle":"Master Course Corporate Finance","ziele":"This course provides an introduction to the financial management of corporations. It will analyze the financial decisions made in a company. The course aims to introduce the concepts of risk, return and valuation, enabling students to apply the basic tools of finance on investment and financing decisions.\n","lehrinhalte":"This course provides a detailed examination of key theoretical and practical issues in finance. Major topical areas include the measurement of risk and return, cost of capital, equity and fixed income valuation, capital budgeting, financing decisions, financial forecasting and planning, breakeven analysis and corporate restructuring and risk management. The objectives of the course are to develop the financial and analytical skills, logical thought processes and information literacy necessary to make and implement strategic corporate financial decisions in a global environment.\n","beurteilung":"Cases and final exam. Final examination is closed books\/notes.\n","sonstiges":null,"voraussetzungen":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>keine (die Zulassung zum Studium vorausgesetzt)\n","methoden":"Study of the various topics will be conducted through lectures and case analyses. Business cases will be discussed in class. Students are expected to have read the assigned material before class. Student participation and questions are strongly encouraged.\n","literatur":"Financial Management, Theory and Practice by Brigham and Ehrhardt, 13th edition, South-Western, Cengage Learning Publisher (ISBN13: 978-0-324-42269-6).<br \/>Corporate Finance, Theory and Practice by Vernimmen, P. et al., Second Edition, John Wiley &amp; Sons, 2009 (ISBN: 978-0-470-72192-6).\n","equivalent":null,"children":[]}