{"id":"5415","code":"2IMESE","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVPraxisprojektseminarInternationalesMarketingSE","type":"3","ects":"4","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"5415","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"2","langname":"Englisch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Diplomstudium","curriculumname":"Diplomstudium Wirtschaftswissenschaften 2009W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Diplom","levelshort":"D","title":"Seminar Applied International Marketing","headtitle":"Seminar Applied International Marketing","ziele":"Course objectives are based on material from previous lectures and courses which enable students to confront real world issues in the field of international marketing that can be applied to companies of various sizes. Students will apply acquired expertise towards developing alternative problem solutions, learning how to select the most optimal solution(s), and successfully implementing international marketing strategies and programs. The problem settings are commonly found in small and large emerging markets. \n","lehrinhalte":"Course content varies by semester and is based on real case studies either from the Department Marketing for Emerging Markets' selection or in cooperation with companies. Common case settings include: \ncollecting marketing intelligence aimed at market entry, changing market environments, cultural aspects, consumer behaviour in emerging markets, buying behaviour of companies, analysis of competition, development of market entry strategies and programs, strategies in emerging markets, global sourcing, international diffusion of new products, global branding, global communication, global channels of distribution, international salesforce management. Emerging issues e.g. internet, institutional changes and strategic responses of firms from emerging markets, small multinational enterprises under globalization, ethics and corporate responsibility for marketing in the global emerging market place.\n","beurteilung":"Reports, presentations, written examination. \n","sonstiges":"If necessary, will be distributed in advance.\n","voraussetzungen":null,"methoden":"Case studies, projects and project collaboration with companies, presentations, discussions, written case and project reports. \n","literatur":"Depends on the focus of case studies and projects; will be made available in advance.\n","equivalent":null,"children":[]}