{"id":"7267","code":"926WIRE13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachWahlfachInformationsrecht","type":"1","ects":"0 oder 6","verantname":"Johann Höller","verantemail":"johann.hoeller@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Eine Lehrveranstaltungsprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Rechtswissenschaften","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Wahlfach Informationsrecht","headtitle":"Wahlfach Informationsrecht","ziele":"Die Studierenden besitzen vertiefte Kenntnisse der rechtlichen Rahmenbedingungen in den für die Wirtschaftsinformatik relevanten Entscheidungsfeldern. Sie können einfache rechtliche Frage- und Problemstellungen selbst lösen. Sie besitzen die Fähigkeit, alternative technisch-organisatorische Lösungen im Hinblick auf ihre rechtlichen Auswirkungen zu beurteilen und können in Kooperation mit RechtsexpertInnen gesetzeskonforme Lösungen implementieren.\n","lehrinhalte":"Rechtsfragen von IT-Anwendungssystemen: Urheberrecht für Software, Open Source, Softwarepatente, Datenbanken; spezifische Probleme von webbasierten IT-Systemen (Domains, Multimedia-Dokumente, Digitale Signatur, E-Mail-Adressen), Personen als IT-Objekte (Informationsfreiheit vs. Datenschutz), IT-basierte Geschäftsmodelle (Auktionsplattformen, Suchmaschinen) und ihre Verankerung im Recht (Anwendbares Recht, Herkunftslandprinzip)\n","beurteilung":"Übernahme der Note des Moduls\n","sonstiges":"Die Vorlesung wird durch einen multimedial aufbereiteten Lehrvortrag gestaltet, die Studierenden werden zum Selbststudium (aus beigestelltem Material) angeleitet.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41185},{"id":41186}]}