{"id":"7356","code":"2WITPJ","pagename":"CurriculumWirtschaftsinformatikB02008W.LVIT-ProjektWirtschaftsinformatikUE","type":"3","ects":"6","verantname":"Gustav Pomberger","verantemail":"gustav.pomberger@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7356","wst":"4","teilungsziffer":"15","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 3. Jahr","levelshort":"B3","title":"IT-Projekt Wirtschaftsinformatik","headtitle":"IT-Projekt Wirtschaftsinformatik","ziele":"Die Studierenden können Informationssysteme analysieren, entwerfen, implementieren, einführen und\/oder evaluieren. Sie verstehen die Theorie und die Praxis der Wirtschaftsinformatik und können sie reflektieren und miteinander verbinden. Sie erkennen die Notwendigkeit des integrierten und sozio-technischen Ansatzes zur Lösung von Praxisproblemen, insbesondere die Integration von betriebswirtschaftlichen, technischen und sozialwissenschaftlichen Ansätzen unter Berücksichtigung wichtiger Rahmenbedingungen wie Rechtsnormen und Rechtsprechung. Sie beherrschen ausgewählte Methoden und Werkzeuge für die Abwicklung von IT-Projekten und sind befähigt, in Teams zu arbeiten und Arbeitsergebnisse zu kommunizieren und zu präsentieren.\n","lehrinhalte":"Anwendung und Integration von betriebswirtschaftlichen, technischen und sozialwirtschaftlichen Lösungsansätzen, Methoden, Werkzeugen und Erkenntnissen im Rahmen eines der Praxissituation entsprechenden IT-Projektes. Die konkreten Projekt-Inhalte (Projektausrichtung und -art) variieren.\n","beurteilung":"Die Lehrveranstaltung hat immanenten Prüfungscharakter. Beurteilungsgrundlage sind die Intensität und Professionalität der Mitarbeit, sowie die erzielten Ergebnisse.<br \/>Die Benotung erfolgt aufgrund des Projektergebnisses und des schriftlichen Projektberichts sowie der laufenden Präsentationen von Zwischen- und Endergebnissen.\n","sonstiges":"Das IT-Projekt wird bewusst nicht als außeruniversitäre \"Ferialpraxis\" und auch nicht als rein akademische Lehrveranstaltung abgehalten. Vielmehr werden die Studierenden dabei gemeinsam durch ExpertInnen oder PraktikerInnen aus dem \"Feld\" und UniversitätslehrerInnen betreut, um diese bei der praktischen Anwendung der im Studium erworbenen Kenntnisse sowie beim weitgehend selbständigen Erwerb von Fähigkeiten und Fertigkeiten zu projektrelevanten, spezifischen Methoden und Werkzeugen zu begleiten. Die Studierenden erbringen vor allem mündliche und schriftliche Beiträge, insbesondere Präsentationen der Projektergebnisse sowie einen Abschlussbericht des Projekts und leisten Entwicklungsarbeiten.\n","voraussetzungen":"Siehe <a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftsinformatikB02008W\/FachIT-Projekt'> IT-Projekt<\/a>\n","methoden":null,"literatur":"Den Studierenden wird die Möglichkeit geboten, die für die konkrete Aufgabenstellung des IT-Projekts relevante Literatur von Digitalen Bibliotheken wie z.B. ACM, IEEE und SpringerLink zu beziehen. Darüber hinaus stehen die Fachbereichsbibliothek „Betriebswirtschaftslehre, Wirtschaftsinformatik und Fachsprachen“ sowie die Präsenzbibliothek des jeweiligen Instituts zur Verfügung.\n","equivalent":null,"children":[]}