{"id":"5425","code":"2IMGTGSM","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVGlobalStrategicManagementIK","type":"3","ects":"3","verantname":"Tina Ambos","verantemail":"tina.ambos@jku.at","changedate":"2012-09-13 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"5425","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"3","langname":null,"lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Diplomstudium","curriculumname":"Diplomstudium Wirtschaftswissenschaften 2009W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Diplom","levelshort":"D","title":"Master Seminar Global Strategic Management","headtitle":"Master Seminar Global Strategic Management","ziele":"<sup><acronym title='Leider ist diese Information in Deutsch nicht verfügbar.'>(*)<\/acronym><\/sup>This course aims at developing strategic thinking in a global context. The main objectives of this course are: \n- To introduce students to domain of international and global strategy\n<\/p>\n<p class='vspace'>- To gain understanding and processes of strategy formulation and implementation and apply them in a global setting\n<\/p>\n<p class='vspace'>- To be aware of competing arguments behind a number of strategic approaches \n<\/p>\n<p class='vspace'>- To emphasize the generalist nature of management work\n<\/p>\n<p class='vspace'>- To learn to work together as a team\n<\/p>\n<p class='vspace'>Upon completion of this course, students should have:\n<\/p>\n<p class='vspace'>- The ability to conduct a strategic analysis in a global stetting.\n<\/p>\n<p class='vspace'>- The ability to take a holistic approach to the application of analytical frameworks and tools.\n<\/p>\n<p class='vspace'>- The knowhow to obtain and analyze information which will aid decision making.\n<\/p>\n<p class='vspace'>- The ability to analyze cases which approximates closely to the rapid analysis of global business situations.\n<\/p>\n<div class='vspace'><\/div>","lehrinhalte":"<sup><acronym title='Leider ist diese Information in Deutsch nicht verfügbar.'>(*)<\/acronym><\/sup>Utilizing a teaching approach that mixes cases and class discussions, students will learn key concepts and frameworks used in crafting and implement global strategy. The reading will give you a broad picture of what global strategy is all about. Furthermore, this course will provide the students with the opportunity to sharpen the written and oral presentation competencies.\n<\/p>\n<p class='vspace'>The course contains two regular case teaching sessions and three competitive case sessions.<br \/>Preparatory questions will be assigned along with all teaching case sessions. Students are expected to analyze the case within their working group before coming to class and to prepare a five slide Power Point presentation summarizing their key findings. The slides form the basis for the student assessment, as well as the discussion of the cases in the class. \n<\/p>\n<p class='vspace'>In each of three competitive case sessions, two groups (thus, competing session) will be asked to present their case analysis and strategic recommendation for the case at hand. Student will also need to provide a written case analysis before the presentation, which will be made public to the course for comments and critique. Non-presenting students will be asked to provide a question to the presentation prior the session which will form the basis for the participation mark.\n","beurteilung":"<sup><acronym title='Leider ist diese Information in Deutsch nicht verfügbar.'>(*)<\/acronym><\/sup>Group Level (40 %)\n- Analysis for Teaching Cases (10%)\n<\/p>\n<p class='vspace'>- Analysis for Competing Cases (30%)\n<\/p>\n<p class='vspace'>Individual Level (60 %)\n<\/p>\n<p class='vspace'>- In-Class Participation (20%)\n<\/p>\n<p class='vspace'>- Written Exam (40 %)\n<\/p>\n<p class='vspace'>Students will be assessed on:\n<\/p>\n<p class='vspace'>-\tTheir knowledge on the content domain of Global Strategic Management\n<\/p>\n<p class='vspace'>-\tTheir ability to understand the strategic issues in the cases they present, to use the appropriate analytical techniques and to marshal the relevant data\n<\/p>\n<p class='vspace'>-\tThe quality of the presentations, the written reports and the examination questions; by quality in this context we mean the clarity and persuasiveness of each bit of work. This implies an ability to work in teams.\n<\/p>\n<p class='vspace'>-\tStudents failing to participate in their teams will lose the marks for that piece of work.\n","sonstiges":"<sup><acronym title='Leider ist diese Information in Deutsch nicht verfügbar.'>(*)<\/acronym><\/sup>Competing Case Assignment: Each student group is expected to hold one competitive presentation in any of the three competing case sessions. Assignment to groups and sessions will be done in the first lecture. The case assignment consists of two parts: a written case report (1000 words, A4 format, 1.5 spacing, font Times 12) and the actual presentation (.ppt, .key or .pdf format). Both the verbal presentation and the submitted overall report will be assessed.  \n<\/p>\n<p class='vspace'>Teaching Case Assignment:  Each group is required to discuss and prepare the cases specified in the course outline for the respective sessions. For each teaching case assignment, groups may be asked at random to present their findings to the class. Please turn in a hard copy of your presentation material to the instructor at the beginning of the class.\n","voraussetzungen":null,"methoden":null,"literatur":"<sup><acronym title='Leider ist diese Information in Deutsch nicht verfügbar.'>(*)<\/acronym><\/sup>The reading package can be purchased at the department secretary’s office \n","equivalent":null,"children":[]}