{"id":"7054","code":"1BUNTBEK","pagename":"CurriculumWirtschaftswissenschaftenB1.LVUnternehmensbesteuerung","type":"3","ects":"2","verantname":"Harald Moshammer ","verantemail":"harald.moshammer@jku.at","changedate":"2013-07-11 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":"Business and Economics","currversion":"2013W","lv_id":"7054","wst":"1","teilungsziffer":"100","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftswissenschaften 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 2. Jahr","levelshort":"B2","title":"Unternehmensbesteuerung","headtitle":"Unternehmensbesteuerung","ziele":"Ziel der Lehrveranstaltung Unternehmensbesteuerung ist es, ein Basisverständnis für die österreichische Steuerrechtsordnung und die sich daraus ergebenden Anknüpfungspunkte für die Unternehmenslandschaft zu erreichen. \n","lehrinhalte":"Die Lehrveranstaltung ist dergestalt aufgebaut, dass den Studierenden zunächst ein Gesamtüberblick der zu behandelnden Themenstellungen verschafft wird, bevor einzelne Kapitel im Detail abgehandelt werden. Dabei erfolgt zunächst eine theoretische Einführung in den jeweiligen Themenschwerpunkt bevor diese mit konkreten Fallbeispielen unterlegt werden. Abgedeckt werden dabei die Grundlagen der Einkommensbesteuerung (Besteuerung von natürlichen Personen; Einkunftsarten mit Schwerpunkt auf die Unternehmensbesteuerung; Einführung in das Bilanzsteuerrecht; Durchführung von Arbeitnehmerveranlagungen), die Grundlagen der Körperschaftsbesteuerung (Besteuerung von juristischen Personen; Abweichungen und Sondervorschriften zur Besteuerung natürlicher Personen), Einführung in die Umsatzbesteuerung (Unternehmereigenschaft; Besteuerung von Lieferungen und sonstigen Leistungen; Steuerbefreiungen; Steuersätze). Ein wesentlicher Abschnitt des Kurses zeigt die Notwendigkeit der Verknüpfung und Anwendung dieser Steuern im unternehmerischen Planungsprozess, wenn die Kapitalwertmethode unter Berücksichtigung von Steuerwirkungen diskutiert wird.\n","beurteilung":"Beurteilungskriterium ist eine schriftliche Prüfung mit der Dauer von 70 Minuten.\n","sonstiges":null,"voraussetzungen":"<a class='wikilink' href='https:\/\/lss.jku.at\/studienhandbuch\/CurriculumWirtschaftswissenschaftenB1\/LVBilanzierung'>KS Bilanzierung<\/a>\n","methoden":"Die Lehre wird in Form eines Open Content Musss Kurses angeboten, in denen in gesonderten Blöcken zu jedem der diskutierten Abschnitte zunächst den Studierenden die Theorie nähergebracht und anschließend die konkreten Beispiele gelöst werden. \n","literatur":"\"Steuern kompakt in der jeweils aktuellsten Auflage (erscheint jährlich)\nZusätzlich existieren zum Kurs 3 Skripten, wobei im<br \/>ersten Skript die Angaben zu den im Kurs gelösten Beispielen sowie zusätzliche (gelöste) Beispiele<br \/>zweiten Skript eine Vertiefungsgrundlage zum Thema Einkommensbesteuerung<br \/>dritten Skript der Gesetzestext<br \/>zu finden sind.\"\n","equivalent":null,"children":[]}