{"id":"7313","code":"526EIBE13","pagename":"CurriculumWirtschaftsinformatikB02008W.FachEinführungInInformatikUndBetriebssysteme","type":"1","ects":"6","verantname":"Günther Blaschek","verantemail":"guenther.blaschek@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Informatik","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 1. Jahr","levelshort":"B1","title":"Einführung in Informatik und Betriebssysteme","headtitle":"Einführung in Informatik und Betriebssysteme","ziele":"Die Studierenden haben einen Überblick über die Teilgebiete der Informatik und wissen, wie sie untereinander und mit anderen Disziplinen zusammenhängen. Sie kennen die wesentlichen technischen und theoretischen Grundlagen der Informatik, verstehen die Architektur von Betriebssystemen und die dort ablaufenden Prozesse sowie damit zusammenhängende Entwicklungsprobleme.\n","lehrinhalte":"Geschichte und Einteilung der Informatik; Einordnung als Wissenschaft; Informationstheorie, Datenformate zur Speicherung und Übertragung; Struktur und Funktionsweise von Computersystemen; Algorithmen und Datenstrukturen; Programmiersprachen; Theoretische Informatik; Systemsoftware und Anwendungen; Klassifikation von Betriebssystemen, Scheduling Verfahren, Parallelität, Semaphore, Deadlocks, Speicherverwaltung, File-Systeme.\n","beurteilung":"Klausur\n","sonstiges":"Vorlesung Einführung in die Informatik: eingestreute Übungen zur Selbstevaluierung<br \/>\n<\/p>\n<p class='vspace'>Vorlesung Betriebssysteme: Blended Learning unter Verwendung eines E-Learning Systems. Die Lehrveranstaltung ist keine Einführung in das Arbeiten mit einem Betriebssystem eines Herstellers, der Schwerpunkt liegt auf den Grundlagen und prinzipiellen Konzepten.\n","voraussetzungen":"Empfohlen: Vorlesung Einführung in die Informatik für Vorlesung Betriebssysteme\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41255},{"id":41256}]}