{"id":"7212","code":"526GLWNPUK13","pagename":"CurriculumWirtschaftsinformatikB02008W.ModulProzess-UndKommunikationsmodellierung","type":"2","ects":"6","verantname":"Christian Stary","verantemail":"christian.stary@jku.at","changedate":"2013-08-23 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Accumulative module examination","currtypename":"Bachelor's programme","curriculumname":"Bachelor's programme Business Informatics 2013W","fachbereichname":"Business Informatics","typename":"Module","uniname":"Johannes Kepler University Linz","levelname":"Bachelor's programme 1. year","levelshort":"B1","title":"Process and Communication Modeling","headtitle":"Process and Communication Modeling","ziele":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Studierenden können prozessorientiert denken und im Rahmen der Gestaltung von Geschäftsprozessen entsprechende Notationen, Methoden und Werkzeuge benutzen. Sie erkennen Kommunikationsflüsse, können diese spezifizieren und mit entsprechenden Technologiekonzepten hinterlegen. Sie sind befähigt, in betriebswirtschaftlichen und technischen Zusammenhängen auf Basis sozio-technischer Systemgestaltung zu denken, wobei auch vernetzte Abläufe berücksichtigt werden. Die Studierenden können die Qualität von Methoden und Werkzeugen zur Modellierung von Geschäftsprozessen beurteilen.\n","lehrinhalte":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Modelle und Modellbildung; Methoden zur Geschäftsprozess- und Kommunikationsmodellierung; Prozessdiagnose und Prozessmanagement; betriebswirtschaftliche Herleitung und Nutzen: Ziele, Verfahren, Methoden, Notationen und Werkzeuge; technische Verarbeitung: Ziele, Verfahren, Methoden, Notationen und Werkzeuge; Methodisch-integrative Ansätze: vom Geschäftsprozess zum verteilten Informationssystem\n","beurteilung":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Siehe Beschreibung der untergeordneten Lehrveranstaltungen.\n","sonstiges":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Vorlesung und Übung sind aufeinander abgestimmt und sollten daher im selben Semester besucht werden. Sämtliche Inhalte werden in einer e-Learning-Plattform zur Verfügung gestellt, sodass die didaktische Konzeption erfahrbar wird. Abweichend vom klassischen Vorlesungskonzept werden auch in der Vorlesung der Lerninhalt anhand von konzeptuellen und praktischen Fragestellungen bearbeitet und diskutiert.\n<\/p>\n<p class='vspace'>In der Übung erfolgt die praktische Umsetzung der in der Vorlesung konzeptionell erarbeiteten Modellierungs-Ansätze. Es wird ein durchgängiges Szenario eingesetzt, auf das jeweils eine Methode angewandt wird (individuell von jedem\/jeder Studierenden). Das Ergebnis wird in Kleingruppen reflektiert; unter Berücksichtigung der individuellen Lösungen und einer Musterlösung.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41238},{"id":41239}]}