{"id":"7310","code":"526LUVE13","pagename":"CurriculumWirtschaftsinformatikB02008W.FachLeistungserstellungUnd-verwertung","type":"1","ects":"6","verantname":"Karl Dörner","verantemail":"karl.doerner@jku.at","changedate":"2013-08-27 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 2. Jahr","levelshort":"B2","title":"Leistungserstellung und -verwertung","headtitle":"Leistungserstellung und -verwertung","ziele":"Die Studierenden sind mit den Grundlagen und Prinzipien des Marketings, der strategischen Unternehmensführung und der Produktion und Logistik vertraut. Sie verstehen insbesondere wesentliche Elemente wie STP (Segmenting\/Targeting\/Positioning)-Marketing, Marketing-Instrumente (Marketing-Mix), Grundkonzepte der Marketingforschung. Sie kennen die Bedeutung der strategischen Unternehmensführung und sind mit den Dimensionen und Ebenen des Strategieentwicklungsprozesses vertraut. Sie besitzen das nötige Basiswissen zum Verstehen von Problemstellungen im Zusammenhang mit Beschaffungs-, Produktions- und Distributionslogistik.\n","lehrinhalte":"Marketing:<br \/>Stellung des Fachgebiets Marketing in der Betriebswirtschaftslehre als Wissenschaftsgebiet, Einführung ins Marketing, Segmenting-Targeting-Positioning-Marketing, Marketing-Instrumente (Marketing-Mix), Grundbegriffe der Marketingforschung.\n<\/p>\n<p class='vspace'>Strategie:<br \/>Strategie (Einführung, Strategie als Perspektive (inside-out)); Unternehmensanalyse (Einführung, Strategische Ausrichtung: Ressourcen, Fähigkeiten, Kernkompetenzen, Strategie als Position (outside-in)); Umweltanalyse (Einführung, Strategische Positionierung im Wettbewerb und am Markt (STP), Strategie und Strategisches Management; Konzepte, Dimensionen und Ebenen, Strategieprozess).  \n<\/p>\n<p class='vspace'>Produktion und Logistik:<br \/>Basiswissen zu Produktions- und Logistiksystemen, Beschaffungs-, Produktions- und Distributionslogistik.\n","beurteilung":"Klausur je Lehrveranstaltung\n","sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41246},{"id":41247},{"id":41248}]}