{"id":"7242","code":"926AAWI13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachAusgewaehlteAspekteDerWirtschaftsinformatik","type":"1","ects":"6","verantname":"Christian Stary","verantemail":"christian.stary@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Ausgewählte Aspekte der Wirtschaftsinformatik","headtitle":"Ausgewählte Aspekte der Wirtschaftsinformatik","ziele":"Die Studierenden können das in den Basis-, Kern- und Spezialkompetenz vermittelnden Studienfächern erworbene Wissen und die entwickelten Fähigkeiten zur Lösung von praktischen oder wissenschaftlichen Problemstellungen der Wirtschaftsinformatik anwenden. Die Studierenden sind befähigt, typische Themenstellungen aus den Kernbereichen Information Engineering, Software Engineering, Data &amp; Knowledge Engineering und Communications Engineering in den jeweiligen Seminaren selbständig zu bearbeiten. Sie können sich das dafür erforderliche, dem Stand der Technik entsprechende Spezialwissen an Hand der aktuellen Fachliteratur erarbeiten und die Arbeitsergebnisse schriftlich und mündlich professionell darstellen. Grundlegende Techniken des wissenschaftlichen Arbeitens, und zwar Literaturrecherche, strukturierte Auswertung wissenschaftlicher Arbeiten und Präsentation wissenschaftlicher Erkenntnisse werden beherrscht.\n","lehrinhalte":"Der Lehrinhalt und die thematische Ausrichtung der Lehrveranstaltung orientieren sich an den aktuellen Entwicklungen und Trends in Wissenschaft und Praxis des jeweiligen Faches (Information Engineering, Software Engineering, Data &amp; Knowledge Engineering, Communications Engineering).\n","beurteilung":"Die in den einzelnen Modulen verwendeten Prüfungsformen variieren und sind der jeweiligen Modulbeschreibung zu entnehmen. Die Gesamtnote des Faches Ausgewählte Aspekte der Wirtschaftsinformatik wird gemäß § 16 Abs (1) Z 2 Satzungsteil Studienrecht (gewichtete Beurteilung der Modulprüfungen) ermittelt.\n","sonstiges":"Im Rahmen des Faches Ausgewählte Aspekte der Wirtschaftsinformatik sind zwei Seminare zu absolvieren. Es sind jene beiden Seminare zu absolvieren, die nicht bereits im Bachelorstudium in Form des Proseminars\/Seminars absolviert wurden.\n","voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41050},{"id":41051},{"id":41052},{"id":41053}]}