{"id":"7141","code":"2URWIPUBK","pagename":"CurriculumWirtschaftswissenschaftenD02009W.LVUnternehmensbewertungUnd-analyseKS","type":"3","ects":"3","verantname":"Roman Rohatschek","verantemail":"roman.rohatschek@jku.at","changedate":"2013-08-07 00:00:00","version":"2013W","currname":"Wirtschaftswissenschaften","currnameeng":null,"currversion":"2009W","lv_id":"7141","wst":"2","teilungsziffer":"200","zuteilung":"1","lvtyp":"8","wechselnd":"0","sprache":"1","langname":"Deutsch","lvtypname":"Kurs","lvtypshort":"KS","zuteilungname":"Zuteilung nach Vorrangzahl","currtypename":"Diplomstudium","curriculumname":"Diplomstudium Wirtschaftswissenschaften 2009W","fachbereichname":"Betriebswirtschaftslehre","typename":"Lehrveranstaltung","uniname":"Johannes Kepler Universität Linz","levelname":"Diplom","levelshort":"D","title":"Unternehmensbewertung und -analyse","headtitle":"Unternehmensbewertung und -analyse","ziele":null,"lehrinhalte":"Der Bereich <strong>Unternehmensanalyse<\/strong> beschäftigt sich zunächst mit den Anlässen und Zielsetzungen von Unternehmensanalysen und -bewertungen. Darauf aufbauend werden die Grundlagen der Jahresabschlussanalyse als zentrales Element der externen Unternehmenanalyse vermittelt. Dies beinhaltet die grundlegende Konzeption, die Aufbereitung des notwendigen Datenmaterials und die finanz- und erfolgswirtschaftliche Analyse. Dabei werden einerseits die Grenzen der Jahresabschlussanalyse sowie Besonderheiten und Probleme der internationalen Unternehmensanalyse aufgezeigt und andererseits das Spannungsverhältnis von Bilanzpolitik und Jahresabschlussanalyse dargestellt.<br \/>\nDer Bereich <strong>Unternehmensbewertung<\/strong> ist auf die Vermittlung konzeptioneller Grundlagen und möglicher Methoden der Unternehmensbewertung ausgerichtet. Nach der Diskussion der Zusammenhänge von Bewertungszwecken und Bewertungsanlässen und der daraus abgeleiteten Theorie der funktionalen Unternehmensbewertung werden eine Reihe unterschiedlicher anwendbarer Methoden vorgestellt. Die LVA konzentriert sich dabei auf die Konzepte entscheidungsorientierter Bewertungsverfahren in der Ausprägung der Ertragswertmethode sowie des Discounted-Cash-Flow- (DCF) bzw. des Shareholder Value Ansatzes. Zusätzlich werden die Grundlagen der wichtigsten Einzel- und Mischwertverfahren sowie der marktorientierten Bewertungsmethoden diskutiert.\n","beurteilung":"Fallstudie, 2 Teilklausuren\n","sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[]}