{"id":"6155","code":"575WBECOMP10","pagename":"CurriculumWebwissenschaftenM1.ModulOnline-Marktplätze","type":"2","ects":"6","verantname":"Franz Hackl","verantemail":"franz.hackl@jku.at","changedate":"2013-06-05 00:00:00","version":"2013W","currname":"Webwissenschaften","currnameeng":"Web Sciences","currversion":"2013W","pruefungname":"Course examination","currtypename":"Master's programme","curriculumname":"Master's programme Web Sciences 2013W","fachbereichname":"Economics","typename":"Module","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Online Marketplace","headtitle":"Online Marketplace","ziele":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Studierende verstehen die Funktionsweise von Online-Marktplätzen und sind in der Lage, einfache ökonomische Prinzipien im Design dieser Online-Marktplätze zu berücksichtigen. Zu Online-Marktplätzen zählen der klassische e-commerce Bereich (B2C und B2B), Auktionsplattformen aber auch automatisierte e-commerce Börsen (\"many to many electronic exchanges\") mit den damit verbundenen web-basierten Automatisations- und Delegationstechnologien (\"smart bidding agents\", \"price search engines\", \"sniping tools\", \"digital cash\"). Studierende kennen die für strategische Firmen-Entscheidungen auf Online-Marktplätzen relevanten ökonomischen Besonderheiten von Informations- und Kommunikationstechnologiemärkten.\n<\/p>\n<div class='vspace'><\/div>","lehrinhalte":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Lehrveranstaltung beschäftigt sich mit den Besonderheiten von (webbasierten) IT-Märkten. Das sind insbesonders unterschiedliche Umsetzungsstrategien von Preisdiskriminierungsmaßnahmen, Netzwerkexternalitäten, Lock-In, Standards und Standardisierungskriege, ökonomische Aspekte im Umgang mit Patenten und Copyright.\n<\/p>\n<p class='vspace'>Darüber hinaus behandelt die Lehrveranstaltung insbesonders die Funktionsweise und die Wohlfahrtsimplikationen von e-commerce, Auktionsplattformen und automatisierten e-commerce Börsen im B2C und B2B Bereich. In diesem Zusammenhang werden neben den Bestimmungsfaktoren für optimales Firmenverhalten auf Online-Marktplätzen auch die Funktionsweise und die Wirkung von Automatisations- und Delegationstechnologien wie Smart Bidding Agents, Preissuchmaschinen und Sniping Tools besprochen.\n","beurteilung":"<sup><acronym title='Unfortunately this information is not available in english.'>(*)<\/acronym><\/sup>Die Beurteilung des Moduls ergibt sich aus den Leistungen bei einer schriftlichen Klausur, sowie den Leistungen bei einer Präsentation und einer schriftlichen Hausarbeit über ein Thema aus dem Bereich der Online-Marktplätze. \n","sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41061}]}