{"id":"7248","code":"2WATPBISE","pagename":"CurriculumWirtschaftsinformatikM02008W.LVAdvancedTextProductionInBusinessInformaticsSE","type":"3","ects":"3","verantname":"Evelyne Glaser","verantemail":"evelyne.glaser@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","lv_id":"7248","wst":"2","teilungsziffer":"25","zuteilung":"1","lvtyp":"11","wechselnd":"0","sprache":"2","langname":"English","lvtypname":"Seminar","lvtypshort":"SE","zuteilungname":"Assignment according to priority","currtypename":"Master's programme","curriculumname":"Master's programme Business Informatics 2013W","fachbereichname":"Languages","typename":"Course","uniname":"Johannes Kepler University Linz","levelname":"Master's programme 1. year","levelshort":"M1","title":"Advanced Text Production in Business Informatics","headtitle":"Advanced Text Production in Business Informatics","ziele":"Student learning goals include in-depth language instruction to improve fluency in speaking and writing English, particularly in regards to topics in Business Informatics. \n","lehrinhalte":"Course content includes learning how to plan, structure and create academic\/scientific texts (particularly for Master's degree theses) as well as how to prepare presentations in the field of Business Informatics using subject-specific English terminology. Students will also learn how to prepare critical discussions that include specialized texts, how to develop and practice argumentation, and how to write abstracts, proposals, and personal profiles to be used for publications and conferences. \n","beurteilung":"The course grade is a composite of results from course writing assignments (25%), poster and presentation (25%), and the research paper (50%).\n","sonstiges":"The seminar \"Advanced Text Production in Business Informatics\" is offered in combination with the course \"Selected Aspects of Business Informatics\" (=\"Ausgewählte Aspekte der Wirtschaftsinformatik\"), or is to be completed together with the Master's thesis seminar.  The techniques learned in the language course on selected topics in Business Informatic seminars will be practiced and practically applied.  The course requires students to submit a joint, subject related and language specific final paper and\/or Master's thesis and a presentation. Grades are awarded on an individual basis and are subject to the discretion of each course instructor.\n","voraussetzungen":null,"methoden":"Lecture, discussion, practice with different techniques; Web-based course materials provided by the instructor.\n","literatur":"Web-based materials<br \/>Course materials provided by instructor\n<\/p>\n<div class='vspace'><\/div><ul><li>Davis, M. (1997). Scientific Papers and Presentations, San Diego: Academic Press.\n<\/li><li>Gustavii, B. (2008). How to Write and Illustrate a Scientific Paper. Cambridge: Cambridge University Press.\n<\/li><li>Malmfors, B., Garnsworthy, P., &amp; Grossman, M. (2004). Writing and Presenting Scientific Papers. Nottingham: Nottingham University Press.\n<\/li><\/ul>","equivalent":null,"children":[]}