{"id":"7261","code":"926MARK13","pagename":"CurriculumWirtschaftsinformatikM02008W.FachMarketingSpezialkompetenzImMasterstudiumWirtschaftsinformatik","type":"1","ects":"12. 18","verantname":"Gerhard Wührer","verantemail":"gerhard.wuehrer@jku.at","changedate":"2013-08-26 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Fachprüfung","currtypename":"Masterstudium","curriculumname":"Masterstudium Wirtschaftsinformatik 2013W","fachbereichname":"Betriebswirtschaftslehre","typename":"Studienfach","uniname":"Johannes Kepler Universität Linz","levelname":"Master 1. Jahr","levelshort":"M1","title":"Marketing","headtitle":"Marketing","ziele":"Die Studierenden besitzen vertiefte Kenntnisse in Marketing, die auf den Grundlagen der Wirtschaftswissenschaften aufbauen und ihnen ermöglichen, gemeinsam mit BetriebswirtInnen Informationssysteme im Bereich Marketing und Customer Relationship Management zu entwickeln und einzusetzen.\n<\/p>\n<p class='vspace'>Die Studierenden besitzen die Fähigkeit, wesentliche Konzepte des Marketings im nationalen und internationalen Kontext anzuwenden. Sie sind in der Lage, Problemstellungen zu präzisieren, Instrumente zur Deckung des Informationsbedarfs für Marketingentscheidungen einzusetzen, Lösungsalternativen auf strategischer und instrumenteller Ebene zu entwickeln und zu bewerten sowie Implementierungsvoraussetzungen zu schaffen und zu nutzen. Das entscheidungsrelevante Wissen erlaubt es ihnen, den Erfolg der Umsetzung von Marketingentscheidungen zu bewerten.\n","lehrinhalte":"Grundlagen des Marketings und Anwendungen in der Praxis, Grundlagen des internationalen Marketing, konzeptionellen wie auch umsetzungsrelevante Aspekte des Business-to-Business-Marketing.\n","beurteilung":null,"sonstiges":null,"voraussetzungen":null,"methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41116},{"id":41118},{"id":41121}]}