{"id":"7211","code":"526GLWNDAM13","pagename":"CurriculumWirtschaftsinformatikB02008W.ModulDatenmodellierung","type":"2","ects":"6","verantname":"Michael Schrefl","verantemail":"michael.schrefl@jku.at","changedate":"2013-08-23 00:00:00","version":"2013W","currname":"Wirtschaftsinformatik","currnameeng":"Business Informatics","currversion":"2013W","pruefungname":"Kumulative Modulprüfung","currtypename":"Bachelorstudium","curriculumname":"Bachelorstudium Wirtschaftsinformatik 2013W","fachbereichname":"Wirtschaftsinformatik","typename":"Modul","uniname":"Johannes Kepler Universität Linz","levelname":"Bachelor 2. Jahr","levelshort":"B2","title":"Datenmodellierung","headtitle":"Datenmodellierung","ziele":"Die Studierenden kennen Architekturkonzepte für Datenbanksysteme und Gründe für ihren Einsatz. Sie kennen die grundlegenden Konzepte für den Entwurfsprozess von Datenbanksystemen, um diese auf Basis einer Anforderungsspezifikation implementieren zu können. Sie sind in der Lage, den Entwurfsprozess mit konkreten Datenmodellen durchzuführen. Sie kennen Abfragesprachen, um interaktiv und aus (Web-)Anwendungen Daten zu definieren, abzufragen und zu manipulieren. Sie sind mit Problemen und Techniken des Zugriffsschutzes vertraut.\n","lehrinhalte":"Gründe für den Einsatz von Datenbanksystemen, Architektur von Datenbankverwaltungssystemen; Datenbankentwurfsprozess: konzeptueller, logischer und physischer Entwurf; konzeptuelle Datenmodelle: Entity-Relationship-Modell und UML; logische Datenmodelle: relationales und objektrelationales Datenmodell; Physische Datenorganisation: Indexstrukturen; Datenbankdefinition und Datenbankzugriff mit interaktiven Abfragesprachen, Datenbankzugriff aus (Web-)Anwendungen, Zugriffsschutz in Datenbanksystemen.\n","beurteilung":"Siehe Beschreibung der untergeordneten Lehrveranstaltungen.\n","sonstiges":"Die in der Vorlesung behandelten Themengebiete werden durch Bearbeitung praxisnaher Beispiele vertieft. Bei den Themengebieten SQL, JDBC und WebML werden die Beispiele unter Anleitung des\/der Übungsleiters\/In von den Studierenden unter Verwendung von geeigneten Werkzeugen im Labor oder über das Internet bearbeitet. Zu jedem Themengebiet werden Übungsaufgaben vergeben, die von den Studierenden im Selbststudium ausgearbeitet werden. Die Bearbeitung der Übungsaufgaben erfolgt online mit Hilfe des elektronischen Tutoringsystems \"eTutor\". Das eTutor System leistet den Studierenden Hilfestellung beim Finden und Beheben von Fehlern im Bearbeitungsprozess und übernimmt die automatisierte Bewertung der Lösung. Zudem werden die automatischen Bewertungen von studentischen MitarbeiterInnen überprüft. Die abschließende Beurteilung erfolgt durch die Lehrveranstaltungsleitung.\n<\/p>\n<p class='vspace'>Charakteristisches Merkmal der hier eingesetzten Lehrform ist das Arbeiten mit einem E-Tutor-System.\n","voraussetzungen":"Empfohlen: Modul Einführung in die Softwareentwicklung aus Fach Grundlagen der Informatik\n","methoden":null,"literatur":null,"equivalent":null,"children":[{"id":41235},{"id":41236}]}